[NoCoverage] BlockStatement
src/library/cache.js:2:20
 export default class Cache {
-    constructor () {
-        this.map = new Map();
-    }
+    constructor () {}
 
     getOrInsertWith (string, fn) {

[NoCoverage] BlockStatement
src/library/cache.js:6:34
         this.map = new Map();
     }
 
-    getOrInsertWith (string, fn) {
-        if (!this.map.has(string)) {
-            this.map.set(string, fn());
-        }
-
-        return this.map.get(string);
-    }
+    getOrInsertWith (string, fn) {}
 }
 

[NoCoverage] BlockStatement
src/library/cache.js:7:36
     }
 
     getOrInsertWith (string, fn) {
-        if (!this.map.has(string)) {
-            this.map.set(string, fn());
-        }
+        if (!this.map.has(string)) {}
 
         return this.map.get(string);

[NoCoverage] ConditionalExpression
src/library/cache.js:7:13
     }
 
     getOrInsertWith (string, fn) {
-        if (!this.map.has(string)) {
+        if (true) {
             this.map.set(string, fn());
         }
