[NoCoverage] ArrayDeclaration
src/library/operators.js:52:18
         LOGICAL_OR,
     ],
 
-    conditional: [
-        RIGHTWARDS_ARROW,
-        RIGHTWARDS_DOUBLE_ARROW,
-    ],
+    conditional: [],
 
     biconditional: [
