[Killed] BlockStatement
src/library/expressions.js:2:16
 export class Expression {
-    isEqual () {
-        throw new Error('Cannot call a abstract method');
-    }
+    isEqual () {}
 }
 
killedBy: Expressions Cannot call isEqual without override it
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/library/expressions.js:8:25
 }
 
 export class UnaryExpression extends Expression {
-    constructor (inner) {
-        super();
-
-        this.inner = inner;
-    }
+    constructor (inner) {}
 
     getInner () {
killedBy: Expressions Name expression Should not be equal if other expression is not a name expression
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/library/expressions.js:14:17
         this.inner = inner;
     }
 
-    getInner () {
-        return this.inner;
-    }
+    getInner () {}
 }
 
killedBy: Interpreter Should throw error if unary expression is not expected
statusReason: expected [Function] to throw error including 'Unable to evaluate unary expression' but got 'Unable to evaluate expression'

[Killed] BlockStatement
src/library/expressions.js:20:31
 }
 
 export class BinaryExpression extends Expression {
-    constructor (left, right) {
-        super();
-
-        this.left = left;
-        this.right = right;
-    }
+    constructor (left, right) {}
 
     getLeft () {
killedBy: Expressions Not expression Should not be equal if other expression is not a not expression
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/library/expressions.js:27:16
         this.right = right;
     }
 
-    getLeft () {
-        return this.left;
-    }
+    getLeft () {}
 
     getRight () {
killedBy: Interpreter Should throw error if binary expression is not expected
statusReason: expected [Function] to throw error including 'Unable to evaluate binary expression' but got 'Unable to evaluate expression'

[Killed] BlockStatement
src/library/expressions.js:31:17
         return this.left;
     }
 
-    getRight () {
-        return this.right;
-    }
+    getRight () {}
 }
 
killedBy: Generator Should generate table the whole expression
statusReason: Unexpected expression

[Killed] BlockStatement
src/library/expressions.js:37:24
 }
 
 export class NameExpression extends Expression {
-    constructor (name) {
-        super();
-
-        this.name = name;
-    }
+    constructor (name) {}
 
     getName () {
killedBy: Expressions Name expression Should be equal if other expression is a name expression and name is equal
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/library/expressions.js:47:21
         return this.name;
     }
 
-    isEqual (other) {
-        return other instanceof NameExpression && this.name === other.name;
-    }
+    isEqual (other) {}
 }
 
killedBy: Expressions Name expression Should be equal if other expression is a name expression and name is equal
statusReason: expected undefined to be truthy

[Killed] LogicalOperator
src/library/expressions.js:48:16
     }
 
     isEqual (other) {
-        return other instanceof NameExpression && this.name === other.name;
+        return other instanceof NameExpression || this.name === other.name;
     }
 }
killedBy: Expressions Name expression Should not be equal if other expression is a name expression but other name is not equal
statusReason: expected true to be falsy

[Killed] ConditionalExpression
src/library/expressions.js:48:51
     }
 
     isEqual (other) {
-        return other instanceof NameExpression && this.name === other.name;
+        return other instanceof NameExpression && true;
     }
 }
killedBy: Expressions Name expression Should not be equal if other expression is a name expression but other name is not equal
statusReason: expected true to be falsy

[Killed] BlockStatement
src/library/expressions.js:53:21
 }
 
 export class NotExpression extends UnaryExpression {
-    isEqual (other) {
-        return other instanceof NotExpression && this.inner.isEqual(other.inner);
-    }
+    isEqual (other) {}
 }
 
killedBy: Expressions Not expression Should be equal if other expression is a not expression and its inner expression is equal
statusReason: expected undefined to be truthy

[Killed] ConditionalExpression
src/library/expressions.js:54:16
 
 export class NotExpression extends UnaryExpression {
     isEqual (other) {
-        return other instanceof NotExpression && this.inner.isEqual(other.inner);
+        return true;
     }
 }
killedBy: Expressions Not expression Should not be equal if other expression is a not expression but its inner expression is not equal
statusReason: expected true to be falsy

[Killed] LogicalOperator
src/library/expressions.js:54:16
 
 export class NotExpression extends UnaryExpression {
     isEqual (other) {
-        return other instanceof NotExpression && this.inner.isEqual(other.inner);
+        return other instanceof NotExpression || this.inner.isEqual(other.inner);
     }
 }
killedBy: Expressions Not expression Should not be equal if other expression is a not expression but its inner expression is not equal
statusReason: expected true to be falsy

[Killed] BlockStatement
src/library/expressions.js:59:21
 }
 
 export class AndExpression extends BinaryExpression {
-    isEqual (other) {
-        return other instanceof AndExpression
-            && this.left.isEqual(other.left)
-            && this.right.isEqual(other.right);
-    }
+    isEqual (other) {}
 }
 
killedBy: Expressions And expression Should be equal if other expression is a and expression and both sides are equal
statusReason: expected undefined to be truthy

[Killed] ConditionalExpression
src/library/expressions.js:60:16
 
 export class AndExpression extends BinaryExpression {
     isEqual (other) {
-        return other instanceof AndExpression
-            && this.left.isEqual(other.left)
-            && this.right.isEqual(other.right);
+        return true;
     }
 }
killedBy: Expressions And expression Should not be equal if other expression is a and expression but left side is not equal
statusReason: expected true to be falsy

[Killed] ConditionalExpression
src/library/expressions.js:60:16
 
 export class AndExpression extends BinaryExpression {
     isEqual (other) {
-        return other instanceof AndExpression
-            && this.left.isEqual(other.left)
+        return true
             && this.right.isEqual(other.right);
     }
killedBy: Expressions And expression Should not be equal if other expression is a and expression but left side is not equal
statusReason: expected true to be falsy

[Killed] BlockStatement
src/library/expressions.js:67:21
 }
 
 export class OrExpression extends BinaryExpression {
-    isEqual (other) {
-        return other instanceof OrExpression
-            && this.left.isEqual(other.left)
-            && this.right.isEqual(other.right);
-    }
+    isEqual (other) {}
 }
 
killedBy: Expressions Or expression Should be equal if other expression is a or expression and both sides are equal
statusReason: expected undefined to be truthy

[Killed] ConditionalExpression
src/library/expressions.js:68:16
 
 export class OrExpression extends BinaryExpression {
     isEqual (other) {
-        return other instanceof OrExpression
-            && this.left.isEqual(other.left)
-            && this.right.isEqual(other.right);
+        return false;
     }
 }
killedBy: Expressions Or expression Should be equal if other expression is a or expression and both sides are equal
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/library/expressions.js:68:16
 
 export class OrExpression extends BinaryExpression {
     isEqual (other) {
-        return other instanceof OrExpression
-            && this.left.isEqual(other.left)
-            && this.right.isEqual(other.right);
+        return true;
     }
 }
killedBy: Expressions Or expression Should not be equal if other expression is a or expression but left side is not equal
statusReason: expected true to be falsy

[Killed] BlockStatement
src/library/expressions.js:75:21
 }
 
 export class ConditionalExpression extends BinaryExpression {
-    isEqual (other) {
-        return other instanceof ConditionalExpression
-            && this.left.isEqual(other.left)
-            && this.right.isEqual(other.right);
-    }
+    isEqual (other) {}
 }
 
killedBy: Expressions Conditional expression Should be equal if other expression is a conditional expression and both sides are equal
statusReason: expected undefined to be truthy

[Killed] LogicalOperator
src/library/expressions.js:76:16
 
 export class ConditionalExpression extends BinaryExpression {
     isEqual (other) {
-        return other instanceof ConditionalExpression
-            && this.left.isEqual(other.left)
+        return other instanceof ConditionalExpression || this.left.isEqual(other.left)
             && this.right.isEqual(other.right);
     }
killedBy: Expressions Conditional expression Should not be equal if other expression is a conditional expression but left side is not equal
statusReason: expected true to be falsy

[Killed] ConditionalExpression
src/library/expressions.js:76:16
 
 export class ConditionalExpression extends BinaryExpression {
     isEqual (other) {
-        return other instanceof ConditionalExpression
-            && this.left.isEqual(other.left)
-            && this.right.isEqual(other.right);
+        return true;
     }
 }
killedBy: Expressions Conditional expression Should not be equal if other expression is a conditional expression but left side is not equal
statusReason: expected true to be falsy

[Killed] BlockStatement
src/library/expressions.js:83:21
 }
 
 export class BiconditionalExpression extends BinaryExpression {
-    isEqual (other) {
-        return other instanceof BiconditionalExpression
-            && this.left.isEqual(other.left)
-            && this.right.isEqual(other.right);
-    }
+    isEqual (other) {}
 }
 
killedBy: Expressions Biconditional expression Should be equal if other expression is a biconditional expression and both sides are equal
statusReason: expected undefined to be truthy

[Killed] ConditionalExpression
src/library/expressions.js:84:16
 
 export class BiconditionalExpression extends BinaryExpression {
     isEqual (other) {
-        return other instanceof BiconditionalExpression
-            && this.left.isEqual(other.left)
-            && this.right.isEqual(other.right);
+        return false;
     }
 }
killedBy: Expressions Biconditional expression Should be equal if other expression is a biconditional expression and both sides are equal
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/library/expressions.js:84:16
 
 export class BiconditionalExpression extends BinaryExpression {
     isEqual (other) {
-        return other instanceof BiconditionalExpression
-            && this.left.isEqual(other.left)
-            && this.right.isEqual(other.right);
+        return true;
     }
 }
killedBy: Expressions Biconditional expression Should not be equal if other expression is a biconditional expression but left side is not equal
statusReason: expected true to be falsy
