[Killed] BlockStatement
library/generator/expressions/extractor.js:7:20
 } from '../../expressions';
 
 export default class ExpressionsExtractor {
-    constructor () {
-        this.expressions = [];
-    }
+    constructor () {}
 
     extract (expression) {
killedBy: Generator Should generate table for a single name expression
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] BlockStatement
library/generator/expressions/extractor.js:11:26
         this.expressions = [];
     }
 
-    extract (expression) {
-        if (expression instanceof BinaryExpression) {
-            this.extract(expression.getLeft());
-            this.extract(expression.getRight());
-        } else if (expression instanceof UnaryExpression) {
-            this.extract(expression.getInner());
-        }
-
-        this.addExpression(expression);
-    }
+    extract (expression) {}
 
     hasExpression (expressionToBeCompared) {
killedBy: Generator Should generate table for a single name expression
statusReason: expected [ [], [ [], [] ] ] to deeply equal [ [ 'x' ], [ [ true ], [ false ] ] ]

[Killed] BlockStatement
library/generator/expressions/extractor.js:12:53
     }
 
     extract (expression) {
-        if (expression instanceof BinaryExpression) {
-            this.extract(expression.getLeft());
-            this.extract(expression.getRight());
-        } else if (expression instanceof UnaryExpression) {
+        if (expression instanceof BinaryExpression) {} else if (expression instanceof UnaryExpression) {
             this.extract(expression.getInner());
         }
killedBy: Generator Should generate table the whole expression
statusReason: expected [ [ 'x ↔ (y ∨ z)' ], …(1) ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
library/generator/expressions/extractor.js:12:13
     }
 
     extract (expression) {
-        if (expression instanceof BinaryExpression) {
+        if (false) {
             this.extract(expression.getLeft());
             this.extract(expression.getRight());
killedBy: Generator Should generate table the whole expression
statusReason: expected [ [ 'x ↔ (y ∨ z)' ], …(1) ] to deeply equal [ …(2) ]

[Killed] BlockStatement
library/generator/expressions/extractor.js:15:59
         if (expression instanceof BinaryExpression) {
             this.extract(expression.getLeft());
             this.extract(expression.getRight());
-        } else if (expression instanceof UnaryExpression) {
-            this.extract(expression.getInner());
-        }
+        } else if (expression instanceof UnaryExpression) {}
 
         this.addExpression(expression);
killedBy: Expression extractor Should extract unique expressions
statusReason: expected [ NotExpression{ …(1) }, …(3) ] to deeply equal [ NameExpression{ name: 'a' }, …(4) ]

[Killed] ConditionalExpression
library/generator/expressions/extractor.js:15:20
         if (expression instanceof BinaryExpression) {
             this.extract(expression.getLeft());
             this.extract(expression.getRight());
-        } else if (expression instanceof UnaryExpression) {
+        } else if (false) {
             this.extract(expression.getInner());
         }
killedBy: Expression extractor Should extract unique expressions
statusReason: expected [ NotExpression{ …(1) }, …(3) ] to deeply equal [ NameExpression{ name: 'a' }, …(4) ]

[Killed] BlockStatement
library/generator/expressions/extractor.js:22:44
         this.addExpression(expression);
     }
 
-    hasExpression (expressionToBeCompared) {
-        return this.expressions.some(currentExpression => {
-            return expressionToBeCompared.isEqual(currentExpression);
-        });
-    }
+    hasExpression (expressionToBeCompared) {}
 
     addExpression (expressionToBeAdded) {
killedBy: Expression extractor Should extract unique expressions
statusReason: expected [ NameExpression{ name: 'a' }, …(8) ] to deeply equal [ NameExpression{ name: 'a' }, …(4) ]

[Killed] MethodExpression
library/generator/expressions/extractor.js:23:16
     }
 
     hasExpression (expressionToBeCompared) {
-        return this.expressions.some(currentExpression => {
-            return expressionToBeCompared.isEqual(currentExpression);
-        });
+        return this.expressions.every(currentExpression => {
+  return expressionToBeCompared.isEqual(currentExpression);
+});
     }
 
killedBy: Expression extractor Should extract unique expressions
statusReason: expected [] to deeply equal [ NameExpression{ name: 'a' }, …(4) ]

[Killed] BlockStatement
library/generator/expressions/extractor.js:23:59
     }
 
     hasExpression (expressionToBeCompared) {
-        return this.expressions.some(currentExpression => {
-            return expressionToBeCompared.isEqual(currentExpression);
-        });
+        return this.expressions.some(currentExpression => {});
     }
 
killedBy: Expression extractor Should extract unique expressions
statusReason: expected [ NameExpression{ name: 'a' }, …(8) ] to deeply equal [ NameExpression{ name: 'a' }, …(4) ]

[Killed] BlockStatement
library/generator/expressions/extractor.js:28:41
         });
     }
 
-    addExpression (expressionToBeAdded) {
-        if (!this.hasExpression(expressionToBeAdded)) {
-            this.expressions.push(expressionToBeAdded);
-        }
-    }
+    addExpression (expressionToBeAdded) {}
 
     getExpressions () {
killedBy: Expression extractor Should extract unique expressions
statusReason: expected [] to deeply equal [ NameExpression{ name: 'a' }, …(4) ]

[Killed] ConditionalExpression
library/generator/expressions/extractor.js:29:13
     }
 
     addExpression (expressionToBeAdded) {
-        if (!this.hasExpression(expressionToBeAdded)) {
+        if (false) {
             this.expressions.push(expressionToBeAdded);
         }
killedBy: Expression extractor Should extract unique expressions
statusReason: expected [] to deeply equal [ NameExpression{ name: 'a' }, …(4) ]

[Killed] BlockStatement
library/generator/expressions/extractor.js:29:55
     }
 
     addExpression (expressionToBeAdded) {
-        if (!this.hasExpression(expressionToBeAdded)) {
-            this.expressions.push(expressionToBeAdded);
-        }
+        if (!this.hasExpression(expressionToBeAdded)) {}
     }
 
killedBy: Expression extractor Should extract unique expressions
statusReason: expected [] to deeply equal [ NameExpression{ name: 'a' }, …(4) ]

[Killed] BlockStatement
library/generator/expressions/extractor.js:34:23
         }
     }
 
-    getExpressions () {
-        return this.expressions;
-    }
+    getExpressions () {}
 }
killedBy: Expression extractor Should extract unique expressions
statusReason: expected undefined to deeply equal [ NameExpression{ name: 'a' }, …(4) ]
