[Killed] ConditionalExpression
library/generator/names/exchanger.js:7:13
 
 export default class NamesExchanger {
     createListOfPermutations (length) {
-        if (length === 0) {
+        if (true) {
             return [];
         }
killedBy: Name exchanger Should exchange the values of the names
statusReason: expected [] to deeply equal [ { a: true, b: true, c: true }, …(7) ]

[Killed] BlockStatement
library/generator/names/exchanger.js:7:27
 
 export default class NamesExchanger {
     createListOfPermutations (length) {
-        if (length === 0) {
-            return [];
-        }
+        if (length === 0) {}
 
         let permutations = [
killedBy: Name exchanger Should accept an empty list of names
statusReason: expected [ {}, {} ] to deeply equal []

[Killed] BooleanLiteral
library/generator/names/exchanger.js:12:14
         }
 
         let permutations = [
-            [true],
+            [false],
             [false],
         ];
killedBy: Name exchanger Should exchange the values of the names
statusReason: expected [ Array(8) ] to deeply equal [ { a: true, b: true, c: true }, …(7) ]

[Killed] BooleanLiteral
library/generator/names/exchanger.js:13:14
 
         let permutations = [
             [true],
-            [false],
+            [true],
         ];
 
killedBy: Name exchanger Should exchange the values of the names
statusReason: expected [ { a: true, b: true, c: true }, …(7) ] to deeply equal [ { a: true, b: true, c: true }, …(7) ]

[Killed] ArrayDeclaration
library/generator/names/exchanger.js:13:13
 
         let permutations = [
             [true],
-            [false],
+            [],
         ];
 
killedBy: Name exchanger Should exchange the values of the names
statusReason: expected [ { a: true, b: true, c: true }, …(7) ] to deeply equal [ { a: true, b: true, c: true }, …(7) ]

[Killed] BlockStatement
library/generator/names/exchanger.js:16:42
             [false],
         ];
 
-        for (let i = 1; i < length; i++) {
-            const trueSlice = [];
-            const falseSlice = [];
-
-            for (let j = 0; j < permutations.length; j++) {
-                trueSlice[j] = [true, ...permutations[j]];
-                falseSlice[j] = [false, ...permutations[j]];
-            }
-
-            permutations = [
-                ...trueSlice,
-                ...falseSlice,
-            ];
-        }
+        for (let i = 1; i < length; i++) {}
 
         return permutations;
killedBy: Name exchanger Should exchange the values of the names
statusReason: expected [ { a: true }, { a: false } ] to deeply equal [ { a: true, b: true, c: true }, …(7) ]

[Survived] ArrayDeclaration
library/generator/names/exchanger.js:17:31
         ];
 
         for (let i = 1; i < length; i++) {
-            const trueSlice = [];
+            const trueSlice = ["Stryker was here"];
             const falseSlice = [];
 

[Survived] ArrayDeclaration
library/generator/names/exchanger.js:18:32
 
         for (let i = 1; i < length; i++) {
             const trueSlice = [];
-            const falseSlice = [];
+            const falseSlice = ["Stryker was here"];
 
             for (let j = 0; j < permutations.length; j++) {

[Killed] UpdateOperator
library/generator/names/exchanger.js:20:54
             const trueSlice = [];
             const falseSlice = [];
 
-            for (let j = 0; j < permutations.length; j++) {
+            for (let j = 0; j < permutations.length; j--) {
                 trueSlice[j] = [true, ...permutations[j]];
                 falseSlice[j] = [false, ...permutations[j]];
killedBy: Generator Should generate table the whole expression
statusReason: permutations[j] is not iterable

[Killed] EqualityOperator
library/generator/names/exchanger.js:20:29
             const trueSlice = [];
             const falseSlice = [];
 
-            for (let j = 0; j < permutations.length; j++) {
+            for (let j = 0; j <= permutations.length; j++) {
                 trueSlice[j] = [true, ...permutations[j]];
                 falseSlice[j] = [false, ...permutations[j]];
killedBy: Generator Should generate table the whole expression
statusReason: permutations[j] is not iterable

[Killed] BooleanLiteral
library/generator/names/exchanger.js:21:33
             const falseSlice = [];
 
             for (let j = 0; j < permutations.length; j++) {
-                trueSlice[j] = [true, ...permutations[j]];
+                trueSlice[j] = [false, ...permutations[j]];
                 falseSlice[j] = [false, ...permutations[j]];
             }
killedBy: Generator Should generate table the whole expression
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ArrayDeclaration
library/generator/names/exchanger.js:21:32
             const falseSlice = [];
 
             for (let j = 0; j < permutations.length; j++) {
-                trueSlice[j] = [true, ...permutations[j]];
+                trueSlice[j] = [];
                 falseSlice[j] = [false, ...permutations[j]];
             }
killedBy: Generator Should generate table the whole expression
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] BooleanLiteral
library/generator/names/exchanger.js:22:34
 
             for (let j = 0; j < permutations.length; j++) {
                 trueSlice[j] = [true, ...permutations[j]];
-                falseSlice[j] = [false, ...permutations[j]];
+                falseSlice[j] = [true, ...permutations[j]];
             }
 
killedBy: Generator Should generate table the whole expression
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] BlockStatement
library/generator/names/exchanger.js:34:57
         return permutations;
     }
 
-    createMapWithPermutedVariables (names, permutation) {
-        const mapWithPermutedVariables = {};
-
-        for (let index = 0; index < permutation.length && index < names.length; index++) {
-            mapWithPermutedVariables[names[index]] = permutation[index];
-        }
-
-        return mapWithPermutedVariables;
-    }
+    createMapWithPermutedVariables (names, permutation) {}
 
     exchange (names) {
killedBy: Generator Should generate table for a single name expression
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] EqualityOperator
library/generator/names/exchanger.js:37:59
     createMapWithPermutedVariables (names, permutation) {
         const mapWithPermutedVariables = {};
 
-        for (let index = 0; index < permutation.length && index < names.length; index++) {
+        for (let index = 0; index < permutation.length && index >= names.length; index++) {
             mapWithPermutedVariables[names[index]] = permutation[index];
         }
killedBy: Generator Should generate table for a single name expression
statusReason: expected [ [ 'x' ], …(1) ] to deeply equal [ [ 'x' ], [ [ true ], [ false ] ] ]

[Killed] EqualityOperator
library/generator/names/exchanger.js:37:29
     createMapWithPermutedVariables (names, permutation) {
         const mapWithPermutedVariables = {};
 
-        for (let index = 0; index < permutation.length && index < names.length; index++) {
+        for (let index = 0; index >= permutation.length && index < names.length; index++) {
             mapWithPermutedVariables[names[index]] = permutation[index];
         }
killedBy: Generator Should generate table
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] BlockStatement
library/generator/names/exchanger.js:44:22
         return mapWithPermutedVariables;
     }
 
-    exchange (names) {
-        return this.createListOfPermutations(names.length)
-            .map(permutation => this.createMapWithPermutedVariables(names, permutation));
-    }
+    exchange (names) {}
 }
killedBy: Generator Should generate table
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
library/generator/names/exchanger.js:46:18
 
     exchange (names) {
         return this.createListOfPermutations(names.length)
-            .map(permutation => this.createMapWithPermutedVariables(names, permutation));
+            .map(() => undefined);
     }
 }
killedBy: Generator Should generate table for a single name expression
statusReason: Cannot read properties of undefined (reading 'x')
