[Killed] BlockStatement
library/generator/names/extractor.js:12:20
  */
 
 export default class NamesExtractor {
-    constructor () {
-        this.names = [];
-    }
+    constructor () {}
 
     extract (expression) {
killedBy: Generator Should generate table
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] BlockStatement
library/generator/names/extractor.js:16:26
         this.names = [];
     }
 
-    extract (expression) {
-        if (expression instanceof NameExpression) {
-            this.addName(expression.getName());
-        } else if (expression instanceof UnaryExpression) {
-            this.extract(expression.getInner());
-        } else if (expression instanceof BinaryExpression) {
-            this.extract(expression.getLeft());
-            this.extract(expression.getRight());
-        } else {
-            throw new Error('Unexpected expression');
-        }
-    }
+    extract (expression) {}
 
     hasName (name) {
killedBy: Generator Should generate table
statusReason: expected [ Array(2) ] to deeply equal [ …(2) ]

[Killed] BlockStatement
library/generator/names/extractor.js:17:51
     }
 
     extract (expression) {
-        if (expression instanceof NameExpression) {
-            this.addName(expression.getName());
-        } else if (expression instanceof UnaryExpression) {
+        if (expression instanceof NameExpression) {} else if (expression instanceof UnaryExpression) {
             this.extract(expression.getInner());
         } else if (expression instanceof BinaryExpression) {
killedBy: Generator Should generate table for a single name expression
statusReason: expected [ [ 'x' ], [] ] to deeply equal [ [ 'x' ], [ [ true ], [ false ] ] ]

[Killed] ConditionalExpression
library/generator/names/extractor.js:17:13
     }
 
     extract (expression) {
-        if (expression instanceof NameExpression) {
+        if (false) {
             this.addName(expression.getName());
         } else if (expression instanceof UnaryExpression) {
killedBy: Generator Should generate table
statusReason: Unexpected expression

[Killed] ConditionalExpression
library/generator/names/extractor.js:19:20
     extract (expression) {
         if (expression instanceof NameExpression) {
             this.addName(expression.getName());
-        } else if (expression instanceof UnaryExpression) {
+        } else if (true) {
             this.extract(expression.getInner());
         } else if (expression instanceof BinaryExpression) {
killedBy: Generator Should generate table
statusReason: expression.getInner is not a function

[Killed] ConditionalExpression
library/generator/names/extractor.js:19:20
     extract (expression) {
         if (expression instanceof NameExpression) {
             this.addName(expression.getName());
-        } else if (expression instanceof UnaryExpression) {
+        } else if (false) {
             this.extract(expression.getInner());
         } else if (expression instanceof BinaryExpression) {
killedBy: Name extractor Should extract names from expression
statusReason: Unexpected expression

[Killed] BlockStatement
library/generator/names/extractor.js:21:60
             this.addName(expression.getName());
         } else if (expression instanceof UnaryExpression) {
             this.extract(expression.getInner());
-        } else if (expression instanceof BinaryExpression) {
-            this.extract(expression.getLeft());
-            this.extract(expression.getRight());
-        } else {
+        } else if (expression instanceof BinaryExpression) {} else {
             throw new Error('Unexpected expression');
         }
killedBy: Name extractor Should extract names from expression
statusReason: expected [] to deeply equal [ 'a', 'b', 'c', 'd' ]

[Killed] ConditionalExpression
library/generator/names/extractor.js:21:20
             this.addName(expression.getName());
         } else if (expression instanceof UnaryExpression) {
             this.extract(expression.getInner());
-        } else if (expression instanceof BinaryExpression) {
+        } else if (false) {
             this.extract(expression.getLeft());
             this.extract(expression.getRight());
killedBy: Name extractor Should extract names from expression
statusReason: Unexpected expression

[Killed] BlockStatement
library/generator/names/extractor.js:24:16
         } else if (expression instanceof BinaryExpression) {
             this.extract(expression.getLeft());
             this.extract(expression.getRight());
-        } else {
-            throw new Error('Unexpected expression');
-        }
+        } else {}
     }
 
killedBy: Name extractor Should throw error if expression is null
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
library/generator/names/extractor.js:29:20
         }
     }
 
-    hasName (name) {
-        return this.names.includes(name);
-    }
+    hasName (name) {}
 
     addName (name) {
killedBy: Name extractor Should extract unique names
statusReason: expected [ 'a', 'b', 'a' ] to deeply equal [ 'a', 'b' ]

[Killed] BlockStatement
library/generator/names/extractor.js:33:20
         return this.names.includes(name);
     }
 
-    addName (name) {
-        if (!this.hasName(name)) {
-            this.names.push(name);
-        }
-    }
+    addName (name) {}
 
     getNames () {
killedBy: Name extractor Should extract names from expression
statusReason: expected [] to deeply equal [ 'a', 'b', 'c', 'd' ]

[Killed] BlockStatement
library/generator/names/extractor.js:34:34
     }
 
     addName (name) {
-        if (!this.hasName(name)) {
-            this.names.push(name);
-        }
+        if (!this.hasName(name)) {}
     }
 
killedBy: Name extractor Should extract names from expression
statusReason: expected [] to deeply equal [ 'a', 'b', 'c', 'd' ]

[Killed] ConditionalExpression
library/generator/names/extractor.js:34:13
     }
 
     addName (name) {
-        if (!this.hasName(name)) {
+        if (true) {
             this.names.push(name);
         }
killedBy: Name extractor Should extract unique names
statusReason: expected [ 'a', 'b', 'a' ] to deeply equal [ 'a', 'b' ]

[Killed] BlockStatement
library/generator/names/extractor.js:39:17
         }
     }
 
-    getNames () {
-        return this.names;
-    }
+    getNames () {}
 }
killedBy: Name extractor Should extract names from expression
statusReason: expected undefined to deeply equal [ 'a', 'b', 'c', 'd' ]
