[Killed] BlockStatement
library/generator/presenter/factory.js:24:25
 } from './implementations';
 
 export default class ExpressionPresenterFactory {
-    create (expression) {
-        if (expression instanceof NameExpression) {
-            return this.createFromNameExpression(expression);
-        }
-
-        if (expression instanceof UnaryExpression) {
-            return this.createFromUnaryExpression(expression);
-        }
-
-        if (expression instanceof BinaryExpression) {
-            return this.createFromBinaryExpression(expression);
-        }
-
-        throw new Error('Unexpected expression');
-    }
+    create (expression) {}
 
     createFromNameExpression(expression) {
killedBy: Generator Should generate table for a single name expression
statusReason: Cannot read properties of undefined (reading 'present')

[Killed] ConditionalExpression
library/generator/presenter/factory.js:25:13
 
 export default class ExpressionPresenterFactory {
     create (expression) {
-        if (expression instanceof NameExpression) {
+        if (true) {
             return this.createFromNameExpression(expression);
         }
killedBy: Generator Should generate table the whole expression
statusReason: expression.getName is not a function

[Killed] BlockStatement
library/generator/presenter/factory.js:25:51
 
 export default class ExpressionPresenterFactory {
     create (expression) {
-        if (expression instanceof NameExpression) {
-            return this.createFromNameExpression(expression);
-        }
+        if (expression instanceof NameExpression) {}
 
         if (expression instanceof UnaryExpression) {
killedBy: Generator Should generate table for a single name expression
statusReason: Unexpected expression

[Killed] ConditionalExpression
library/generator/presenter/factory.js:29:13
             return this.createFromNameExpression(expression);
         }
 
-        if (expression instanceof UnaryExpression) {
+        if (false) {
             return this.createFromUnaryExpression(expression);
         }
killedBy: Expression Presenter Factory Should create not expression presenter
statusReason: Unexpected expression

[Killed] ConditionalExpression
library/generator/presenter/factory.js:29:13
             return this.createFromNameExpression(expression);
         }
 
-        if (expression instanceof UnaryExpression) {
+        if (true) {
             return this.createFromUnaryExpression(expression);
         }
killedBy: Generator Should generate table the whole expression
statusReason: expression.getInner is not a function

[Killed] ConditionalExpression
library/generator/presenter/factory.js:33:13
             return this.createFromUnaryExpression(expression);
         }
 
-        if (expression instanceof BinaryExpression) {
+        if (true) {
             return this.createFromBinaryExpression(expression);
         }
killedBy: Expression Presenter Factory Should throw error if expression is not expected
statusReason: expected [Function] to throw error including 'Unexpected expression' but got 'expression.getLeft is not a function'

[Killed] BlockStatement
library/generator/presenter/factory.js:33:53
             return this.createFromUnaryExpression(expression);
         }
 
-        if (expression instanceof BinaryExpression) {
-            return this.createFromBinaryExpression(expression);
-        }
+        if (expression instanceof BinaryExpression) {}
 
         throw new Error('Unexpected expression');
killedBy: Expression Presenter Factory Should create and expression presenter
statusReason: Unexpected expression

[Killed] BlockStatement
library/generator/presenter/factory.js:40:42
         throw new Error('Unexpected expression');
     }
 
-    createFromNameExpression(expression) {
-        const name = expression.getName();
-
-        return new NameExpressionPresenter(name);
-    }
+    createFromNameExpression(expression) {}
 
     createFromUnaryExpression(expression) {
killedBy: Expression Presenter Factory Should create name expression presenter
statusReason: expected undefined to be an instance of NameExpressionPresenter

[Killed] BlockStatement
library/generator/presenter/factory.js:46:43
         return new NameExpressionPresenter(name);
     }
 
-    createFromUnaryExpression(expression) {
-        const inner = this.create(expression.getInner());
-
-        if (expression instanceof NotExpression) {
-            return new NotExpressionPresenter(inner);
-        }
-
-        throw new Error('Unexpected unary expression');
-    }
+    createFromUnaryExpression(expression) {}
 
     createFromBinaryExpression(expression) {
killedBy: Expression Presenter Factory Should create not expression presenter
statusReason: expected undefined to be an instance of NotExpressionPresenter

[Killed] ConditionalExpression
library/generator/presenter/factory.js:49:13
     createFromUnaryExpression(expression) {
         const inner = this.create(expression.getInner());
 
-        if (expression instanceof NotExpression) {
+        if (true) {
             return new NotExpressionPresenter(inner);
         }
killedBy: Expression Presenter Factory Should throw error if unary expression is not expected
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
library/generator/presenter/factory.js:49:13
     createFromUnaryExpression(expression) {
         const inner = this.create(expression.getInner());
 
-        if (expression instanceof NotExpression) {
+        if (false) {
             return new NotExpressionPresenter(inner);
         }
killedBy: Expression Presenter Factory Should create not expression presenter
statusReason: Unexpected unary expression

[Killed] BlockStatement
library/generator/presenter/factory.js:56:44
         throw new Error('Unexpected unary expression');
     }
 
-    createFromBinaryExpression(expression) {
-        const left = this.create(expression.getLeft());
-        const right = this.create(expression.getRight());
-
-        if (expression instanceof AndExpression) {
-            return new AndExpressionPresenter(left, right);
-        }
-
-        if (expression instanceof OrExpression) {
-            return new OrExpressionPresenter(left, right);
-        }
-
-        if (expression instanceof ConditionalExpression) {
-            return new ConditionalExpressionPresenter(left, right);
-        }
-
-        if (expression instanceof BiconditionalExpression) {
-            return new BiconditionalExpressionPresenter(left, right);
-        }
-
-        throw new Error('Unexpected binary expression');
-    }
+    createFromBinaryExpression(expression) {}
 }
killedBy: Expression Presenter Factory Should create and expression presenter
statusReason: expected undefined to be an instance of AndExpressionPresenter

[Killed] ConditionalExpression
library/generator/presenter/factory.js:60:13
         const left = this.create(expression.getLeft());
         const right = this.create(expression.getRight());
 
-        if (expression instanceof AndExpression) {
+        if (false) {
             return new AndExpressionPresenter(left, right);
         }
killedBy: Expression Presenter Factory Should create and expression presenter
statusReason: Unexpected binary expression

[Killed] ConditionalExpression
library/generator/presenter/factory.js:60:13
         const left = this.create(expression.getLeft());
         const right = this.create(expression.getRight());
 
-        if (expression instanceof AndExpression) {
+        if (true) {
             return new AndExpressionPresenter(left, right);
         }
killedBy: Expression Presenter Factory Should create or expression presenter
statusReason: expected AndExpressionPresenter{ …(2) } to be an instance of OrExpressionPresenter

[Killed] BlockStatement
library/generator/presenter/factory.js:64:49
             return new AndExpressionPresenter(left, right);
         }
 
-        if (expression instanceof OrExpression) {
-            return new OrExpressionPresenter(left, right);
-        }
+        if (expression instanceof OrExpression) {}
 
         if (expression instanceof ConditionalExpression) {
killedBy: Expression Presenter Factory Should create or expression presenter
statusReason: Unexpected binary expression

[Killed] ConditionalExpression
library/generator/presenter/factory.js:64:13
             return new AndExpressionPresenter(left, right);
         }
 
-        if (expression instanceof OrExpression) {
+        if (true) {
             return new OrExpressionPresenter(left, right);
         }
killedBy: Expression Presenter Factory Should create conditional expression presenter
statusReason: expected OrExpressionPresenter{ …(2) } to be an instance of ConditionalExpressionPresenter

[Killed] ConditionalExpression
library/generator/presenter/factory.js:68:13
             return new OrExpressionPresenter(left, right);
         }
 
-        if (expression instanceof ConditionalExpression) {
+        if (true) {
             return new ConditionalExpressionPresenter(left, right);
         }
killedBy: Expression Presenter Factory Should create biconditional expression presenter
statusReason: expected ConditionalExpressionPresenter{ …(2) } to be an instance of BiconditionalExpressionPresenter

[Killed] ConditionalExpression
library/generator/presenter/factory.js:68:13
             return new OrExpressionPresenter(left, right);
         }
 
-        if (expression instanceof ConditionalExpression) {
+        if (false) {
             return new ConditionalExpressionPresenter(left, right);
         }
killedBy: Expression Presenter Factory Should create conditional expression presenter
statusReason: Unexpected binary expression

[Killed] BlockStatement
library/generator/presenter/factory.js:72:60
             return new ConditionalExpressionPresenter(left, right);
         }
 
-        if (expression instanceof BiconditionalExpression) {
-            return new BiconditionalExpressionPresenter(left, right);
-        }
+        if (expression instanceof BiconditionalExpression) {}
 
         throw new Error('Unexpected binary expression');
killedBy: Expression Presenter Factory Should create biconditional expression presenter
statusReason: Unexpected binary expression

[Killed] ConditionalExpression
library/generator/presenter/factory.js:72:13
             return new ConditionalExpressionPresenter(left, right);
         }
 
-        if (expression instanceof BiconditionalExpression) {
+        if (true) {
             return new BiconditionalExpressionPresenter(left, right);
         }
killedBy: Expression Presenter Factory Should throw error if binary expression is not expected
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
library/generator/presenter/factory.js:76:25
             return new BiconditionalExpressionPresenter(left, right);
         }
 
-        throw new Error('Unexpected binary expression');
+        throw new Error("");
     }
 }
killedBy: Expression Presenter Factory Should throw error if binary expression is not expected
statusReason: expected [Function] to throw error including 'Unexpected binary expression' but got ''
