[Killed] BlockStatement
library/generator/presenter/implementations.js:2:37
 export class ExpressionPresenter {
-    shouldPresentWithParenthesis () {
-        throw new Error('Cannot call a abstract method');
-    }
+    shouldPresentWithParenthesis () {}
 }
 
killedBy: Expression Presenter Implementations Cannot call shouldPresentWithParenthesis without override it
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
library/generator/presenter/implementations.js:3:25
 export class ExpressionPresenter {
     shouldPresentWithParenthesis () {
-        throw new Error('Cannot call a abstract method');
+        throw new Error("");
     }
 }
killedBy: Expression Presenter Implementations Cannot call shouldPresentWithParenthesis without override it
statusReason: expected [Function] to throw error including 'Cannot call a abstract method' but got ''

[Killed] BlockStatement
library/generator/presenter/implementations.js:8:23
 }
 
 export class NameExpressionPresenter extends ExpressionPresenter {
-    constructor(name) {
-        super();
-
-        this.name = name;
-    }
+    constructor(name) {}
 
     shouldPresentWithParenthesis() {
killedBy: Expression Presenter Factory Should create name expression presenter
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Survived] BlockStatement
library/generator/presenter/implementations.js:14:36
         this.name = name;
     }
 
-    shouldPresentWithParenthesis() {
-        return false;
-    }
+    shouldPresentWithParenthesis() {}
 
     present() {

[Killed] BooleanLiteral
library/generator/presenter/implementations.js:15:16
     }
 
     shouldPresentWithParenthesis() {
-        return false;
+        return true;
     }
 
killedBy: Generator Should generate table the whole expression
statusReason: expected [ [ 'x', 'y', 'z', …(2) ], [ …(8) ] ] to deeply equal [ …(2) ]

[Killed] BlockStatement
library/generator/presenter/implementations.js:18:15
         return false;
     }
 
-    present() {
-        return this.name;
-    }
+    present() {}
 }
 
killedBy: Generator Should generate table for a single name expression
statusReason: expected [ [ undefined ], …(1) ] to deeply equal [ [ 'x' ], [ [ true ], [ false ] ] ]

[Killed] BlockStatement
library/generator/presenter/implementations.js:24:24
 }
 
 export class UnaryExpressionPresenter extends ExpressionPresenter {
-    constructor(inner) {
-        super();
-
-        this.inner = inner;
-    }
+    constructor(inner) {}
 
     shouldPresentWithParenthesis() {
killedBy: Expression Presenter Factory Should create not expression presenter
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
library/generator/presenter/implementations.js:30:36
         this.inner = inner;
     }
 
-    shouldPresentWithParenthesis() {
-        return true;
-    }
+    shouldPresentWithParenthesis() {}
 
     presentInner() {
killedBy: Expression Presenter Implementations Should present not expression with parenthesis around inner expression
statusReason: expected '¬ ¬ xyz' to deeply equal '¬ (¬ xyz)'

[Killed] BooleanLiteral
library/generator/presenter/implementations.js:31:16
     }
 
     shouldPresentWithParenthesis() {
-        return true;
+        return false;
     }
 
killedBy: Expression Presenter Implementations Should present not expression with parenthesis around inner expression
statusReason: expected '¬ ¬ xyz' to deeply equal '¬ (¬ xyz)'

[Killed] BlockStatement
library/generator/presenter/implementations.js:34:20
         return true;
     }
 
-    presentInner() {
-        if (this.inner.shouldPresentWithParenthesis()) {
-            return `(${this.inner.present()})`;
-        } else {
-            return `${this.inner.present()}`;
-        }
-    }
+    presentInner() {}
 }
 
killedBy: Expression Presenter Implementations Should present not expression
statusReason: expected '¬ undefined' to deeply equal '¬ abc'

[Killed] BlockStatement
library/generator/presenter/implementations.js:35:56
     }
 
     presentInner() {
-        if (this.inner.shouldPresentWithParenthesis()) {
-            return `(${this.inner.present()})`;
-        } else {
+        if (this.inner.shouldPresentWithParenthesis()) {} else {
             return `${this.inner.present()}`;
         }
killedBy: Expression Presenter Implementations Should present not expression with parenthesis around inner expression
statusReason: expected '¬ undefined' to deeply equal '¬ (¬ xyz)'

[Killed] ConditionalExpression
library/generator/presenter/implementations.js:35:13
     }
 
     presentInner() {
-        if (this.inner.shouldPresentWithParenthesis()) {
+        if (false) {
             return `(${this.inner.present()})`;
         } else {
killedBy: Expression Presenter Implementations Should present not expression with parenthesis around inner expression
statusReason: expected '¬ ¬ xyz' to deeply equal '¬ (¬ xyz)'

[Killed] StringLiteral
library/generator/presenter/implementations.js:36:20
 
     presentInner() {
         if (this.inner.shouldPresentWithParenthesis()) {
-            return `(${this.inner.present()})`;
+            return ``;
         } else {
             return `${this.inner.present()}`;
killedBy: Expression Presenter Implementations Should present not expression with parenthesis around inner expression
statusReason: expected '¬ ' to deeply equal '¬ (¬ xyz)'

[Killed] BlockStatement
library/generator/presenter/implementations.js:37:16
     presentInner() {
         if (this.inner.shouldPresentWithParenthesis()) {
             return `(${this.inner.present()})`;
-        } else {
-            return `${this.inner.present()}`;
-        }
+        } else {}
     }
 }
killedBy: Expression Presenter Implementations Should present not expression
statusReason: expected '¬ undefined' to deeply equal '¬ abc'

[Killed] StringLiteral
library/generator/presenter/implementations.js:38:20
         if (this.inner.shouldPresentWithParenthesis()) {
             return `(${this.inner.present()})`;
         } else {
-            return `${this.inner.present()}`;
+            return ``;
         }
     }
killedBy: Expression Presenter Implementations Should present not expression
statusReason: expected '¬ ' to deeply equal '¬ abc'

[Killed] BlockStatement
library/generator/presenter/implementations.js:44:15
 }
 
 export class NotExpressionPresenter extends UnaryExpressionPresenter {
-    present() {
-        return `¬ ${this.presentInner()}`;
-    }
+    present() {}
 }
 
killedBy: Expression Presenter Implementations Should present not expression
statusReason: expected undefined to deeply equal '¬ abc'

[Killed] BlockStatement
library/generator/presenter/implementations.js:50:30
 }
 
 export class BinaryExpressionPresenter extends ExpressionPresenter {
-    constructor(left, right) {
-        super();
-
-        this.left = left;
-        this.right = right;
-    }
+    constructor(left, right) {}
 
     shouldPresentWithParenthesis() {
killedBy: Expression Presenter Factory Should create and expression presenter
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
library/generator/presenter/implementations.js:61:19
         return true;
     }
 
-    presentLeft() {
-        if (this.left.shouldPresentWithParenthesis()) {
-            return `(${this.left.present()})`;
-        } else {
-            return `${this.left.present()}`;
-        }
-    }
+    presentLeft() {}
 
     presentRight() {
killedBy: Generator Should generate table the whole expression
statusReason: expected [ [ 'x', 'y', 'z', …(2) ], [ …(8) ] ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
library/generator/presenter/implementations.js:62:13
     }
 
     presentLeft() {
-        if (this.left.shouldPresentWithParenthesis()) {
+        if (false) {
             return `(${this.left.present()})`;
         } else {
killedBy: Expression Presenter Implementations Should present and expression with parenthesis around both expressions
statusReason: expected '¬ f ∧ (¬ g)' to deeply equal '(¬ f) ∧ (¬ g)'

[Killed] BlockStatement
library/generator/presenter/implementations.js:62:55
     }
 
     presentLeft() {
-        if (this.left.shouldPresentWithParenthesis()) {
-            return `(${this.left.present()})`;
-        } else {
+        if (this.left.shouldPresentWithParenthesis()) {} else {
             return `${this.left.present()}`;
         }
killedBy: Expression Presenter Implementations Should present and expression with parenthesis around both expressions
statusReason: expected 'undefined ∧ (¬ g)' to deeply equal '(¬ f) ∧ (¬ g)'

[Killed] StringLiteral
library/generator/presenter/implementations.js:63:20
 
     presentLeft() {
         if (this.left.shouldPresentWithParenthesis()) {
-            return `(${this.left.present()})`;
+            return ``;
         } else {
             return `${this.left.present()}`;
killedBy: Expression Presenter Implementations Should present and expression with parenthesis around both expressions
statusReason: expected ' ∧ (¬ g)' to deeply equal '(¬ f) ∧ (¬ g)'

[Killed] BlockStatement
library/generator/presenter/implementations.js:64:16
     presentLeft() {
         if (this.left.shouldPresentWithParenthesis()) {
             return `(${this.left.present()})`;
-        } else {
-            return `${this.left.present()}`;
-        }
+        } else {}
     }
 
killedBy: Expression Presenter Implementations Should present and expression
statusReason: expected 'undefined ∧ g' to deeply equal 'f ∧ g'

[Killed] BlockStatement
library/generator/presenter/implementations.js:69:20
         }
     }
 
-    presentRight() {
-        if (this.right.shouldPresentWithParenthesis()) {
-            return `(${this.right.present()})`;
-        } else {
-            return `${this.right.present()}`;
-        }
-    }
+    presentRight() {}
 }
 
killedBy: Expression Presenter Implementations Should present and expression
statusReason: expected 'f ∧ undefined' to deeply equal 'f ∧ g'

[Killed] BlockStatement
library/generator/presenter/implementations.js:70:56
     }
 
     presentRight() {
-        if (this.right.shouldPresentWithParenthesis()) {
-            return `(${this.right.present()})`;
-        } else {
+        if (this.right.shouldPresentWithParenthesis()) {} else {
             return `${this.right.present()}`;
         }
killedBy: Generator Should generate table the whole expression
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
library/generator/presenter/implementations.js:70:13
     }
 
     presentRight() {
-        if (this.right.shouldPresentWithParenthesis()) {
+        if (false) {
             return `(${this.right.present()})`;
         } else {
killedBy: Expression Presenter Implementations Should present and expression with parenthesis around both expressions
statusReason: expected '(¬ f) ∧ ¬ g' to deeply equal '(¬ f) ∧ (¬ g)'

[Killed] BlockStatement
library/generator/presenter/implementations.js:72:16
     presentRight() {
         if (this.right.shouldPresentWithParenthesis()) {
             return `(${this.right.present()})`;
-        } else {
-            return `${this.right.present()}`;
-        }
+        } else {}
     }
 }
killedBy: Generator Should generate table the whole expression
statusReason: expected [ [ 'x', 'y', 'z', …(2) ], [ …(8) ] ] to deeply equal [ …(2) ]

[Killed] BlockStatement
library/generator/presenter/implementations.js:79:15
 }
 
 export class AndExpressionPresenter extends BinaryExpressionPresenter {
-    present() {
-        return `${this.presentLeft()} ∧ ${this.presentRight()}`;
-    }
+    present() {}
 }
 
killedBy: Expression Presenter Implementations Should present and expression
statusReason: expected undefined to deeply equal 'f ∧ g'

[Killed] BlockStatement
library/generator/presenter/implementations.js:85:15
 }
 
 export class OrExpressionPresenter extends BinaryExpressionPresenter {
-    present() {
-        return `${this.presentLeft()} ∨ ${this.presentRight()}`;
-    }
+    present() {}
 }
 
killedBy: Expression Presenter Implementations Should present or expression
statusReason: expected undefined to deeply equal 'h ∨ i'

[Killed] BlockStatement
library/generator/presenter/implementations.js:91:15
 }
 
 export class ConditionalExpressionPresenter extends BinaryExpressionPresenter {
-    present() {
-        return `${this.presentLeft()} → ${this.presentRight()}`;
-    }
+    present() {}
 }
 
killedBy: Expression Presenter Implementations Should present conditional expression
statusReason: expected undefined to deeply equal 'l → m'

[Killed] BlockStatement
library/generator/presenter/implementations.js:97:15
 }
 
 export class BiconditionalExpressionPresenter extends BinaryExpressionPresenter {
-    present() {
-        return `${this.presentLeft()} ↔ ${this.presentRight()}`;
-    }
+    present() {}
 }
killedBy: Expression Presenter Implementations Should present biconditional expression
statusReason: expected undefined to deeply equal 'p ↔ q'
