[Killed] BlockStatement
src/library/generator.js:12:26
 import ExpressionPresenterFactory from './generator/presenter/factory';
 
 export default class Generator {
-    constructor (parser) {
-        this.parser = parser;
-    }
+    constructor (parser) {}
 
     static prepareNames (expression) {
killedBy: Generator Should not generate table if expression is null
statusReason: expected [Function] to throw error including 'Unexpected expression' but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/library/generator.js:16:38
         this.parser = parser;
     }
 
-    static prepareNames (expression) {
-        const extractor = new NamesExtractor();
-
-        extractor.extract(expression);
-
-        const exchanger = new NamesExchanger();
-
-        return exchanger.exchange(extractor.getNames());
-    }
+    static prepareNames (expression) {}
 
     static prepareExpressions (expression) {
killedBy: Generator Should generate table for a single name expression
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/library/generator.js:26:44
         return exchanger.exchange(extractor.getNames());
     }
 
-    static prepareExpressions (expression) {
-        const extractor = new ExpressionsExtractor();
-
-        extractor.extract(expression);
-
-        const sorter = new ExpressionsSorter();
-
-        return sorter.sort(extractor.getExpressions());
-    }
+    static prepareExpressions (expression) {}
 
     static generateValues (mapsWithPermutedVariables, expressions) {
killedBy: Generator Should generate table for a single name expression
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
src/library/generator.js:33:16
 
         const sorter = new ExpressionsSorter();
 
-        return sorter.sort(extractor.getExpressions());
+        return sorter;
     }
 
killedBy: Generator Should generate table for a single name expression
statusReason: expressions.map is not a function

[Killed] BlockStatement
src/library/generator.js:36:68
         return sorter.sort(extractor.getExpressions());
     }
 
-    static generateValues (mapsWithPermutedVariables, expressions) {
-        return mapsWithPermutedVariables.map((mapWithPermutedVariables) => {
-            const interpreter = new Interpreter(mapWithPermutedVariables);
-
-            return expressions.map((expression) => interpreter.evaluate(expression));
-        });
-    }
+    static generateValues (mapsWithPermutedVariables, expressions) {}
 
     static generatePresentableExpressions (expressions) {
killedBy: Generator Should generate table for a single name expression
statusReason: expected [ [ 'x' ], undefined ] to deeply equal [ [ 'x' ], [ [ true ], [ false ] ] ]

[Killed] BlockStatement
src/library/generator.js:37:76
     }
 
     static generateValues (mapsWithPermutedVariables, expressions) {
-        return mapsWithPermutedVariables.map((mapWithPermutedVariables) => {
-            const interpreter = new Interpreter(mapWithPermutedVariables);
-
-            return expressions.map((expression) => interpreter.evaluate(expression));
-        });
+        return mapsWithPermutedVariables.map((mapWithPermutedVariables) => {});
     }
 
killedBy: Generator Should generate table for a single name expression
statusReason: expected [ [ 'x' ], [ undefined, undefined ] ] to deeply equal [ [ 'x' ], [ [ true ], [ false ] ] ]

[Killed] ArrowFunction
src/library/generator.js:40:36
         return mapsWithPermutedVariables.map((mapWithPermutedVariables) => {
             const interpreter = new Interpreter(mapWithPermutedVariables);
 
-            return expressions.map((expression) => interpreter.evaluate(expression));
+            return expressions.map(() => undefined);
         });
     }
killedBy: Generator Should generate table for a single name expression
statusReason: expected [ [ 'x' ], …(1) ] to deeply equal [ [ 'x' ], [ [ true ], [ false ] ] ]

[Killed] BlockStatement
src/library/generator.js:44:57
         });
     }
 
-    static generatePresentableExpressions (expressions) {
-        const expressionPresenterFactory = new ExpressionPresenterFactory();
-
-        return expressions.map((expression) => expressionPresenterFactory.create(expression)).map((expression) => expression.present());
-    }
+    static generatePresentableExpressions (expressions) {}
 
     generate () {
killedBy: Generator Should generate table for a single name expression
statusReason: expected [ undefined, [ [ true ], [ false ] ] ] to deeply equal [ [ 'x' ], [ [ true ], [ false ] ] ]

[Killed] ArrowFunction
src/library/generator.js:47:32
     static generatePresentableExpressions (expressions) {
         const expressionPresenterFactory = new ExpressionPresenterFactory();
 
-        return expressions.map((expression) => expressionPresenterFactory.create(expression)).map((expression) => expression.present());
+        return expressions.map(() => undefined).map((expression) => expression.present());
     }
 
killedBy: Generator Should generate table for a single name expression
statusReason: Cannot read properties of undefined (reading 'present')

[Killed] ArrowFunction
src/library/generator.js:47:99
     static generatePresentableExpressions (expressions) {
         const expressionPresenterFactory = new ExpressionPresenterFactory();
 
-        return expressions.map((expression) => expressionPresenterFactory.create(expression)).map((expression) => expression.present());
+        return expressions.map((expression) => expressionPresenterFactory.create(expression)).map(() => undefined);
     }
 
killedBy: Generator Should generate table for a single name expression
statusReason: expected [ [ undefined ], …(1) ] to deeply equal [ [ 'x' ], [ [ true ], [ false ] ] ]

[Killed] BlockStatement
src/library/generator.js:50:17
         return expressions.map((expression) => expressionPresenterFactory.create(expression)).map((expression) => expression.present());
     }
 
-    generate () {
-        const expression = this.parser.parse();
-
-        const mapsWithPermutedVariables = Generator.prepareNames(expression);
-        const expressions = Generator.prepareExpressions(expression);
-
-        return [
-            Generator.generatePresentableExpressions(expressions),
-            Generator.generateValues(
-                mapsWithPermutedVariables,
-                expressions
-            ),
-        ];
-    }
+    generate () {}
 }
 
killedBy: Generator Should not generate table if expression is null
statusReason: expected [Function] to throw an error
