[Killed] BlockStatement
src/library/interpreter.js:16:29
 } from './expressions';
 
 export default class Interpreter {
-    constructor (variables) {
-        this.variables = variables;
-    }
+    constructor (variables) {}
 
     evaluate (expression) {
killedBy: Generator Should generate table for a single name expression
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] BlockStatement
src/library/interpreter.js:21:51
     }
 
     evaluate (expression) {
-        if (expression instanceof NameExpression) {
-            return this.variables[expression.name];
-        }
+        if (expression instanceof NameExpression) {}
 
         if (expression instanceof UnaryExpression) {
killedBy: Generator Should generate table for a single name expression
statusReason: Unable to evaluate expression

[Killed] ConditionalExpression
src/library/interpreter.js:21:13
     }
 
     evaluate (expression) {
-        if (expression instanceof NameExpression) {
+        if (false) {
             return this.variables[expression.name];
         }
killedBy: Generator Should generate table for a single name expression
statusReason: Unable to evaluate expression

[Killed] BlockStatement
src/library/interpreter.js:25:52
             return this.variables[expression.name];
         }
 
-        if (expression instanceof UnaryExpression) {
-            const inner = this.evaluate(expression.getInner());
-
-            if (expression instanceof NotExpression) {
-                return !inner;
-            }
-
-            throw new Error('Unable to evaluate unary expression');
-        }
+        if (expression instanceof UnaryExpression) {}
 
         if (expression instanceof BinaryExpression) {
killedBy: Interpreter Should throw error if unary expression is not expected
statusReason: expected [Function] to throw error including 'Unable to evaluate unary expression' but got 'Unable to evaluate expression'

[Killed] BlockStatement
src/library/interpreter.js:28:54
         if (expression instanceof UnaryExpression) {
             const inner = this.evaluate(expression.getInner());
 
-            if (expression instanceof NotExpression) {
-                return !inner;
-            }
+            if (expression instanceof NotExpression) {}
 
             throw new Error('Unable to evaluate unary expression');
killedBy: Interpreter Not expression Should evaluate not expression to true if inner is false
statusReason: Unable to evaluate unary expression

[Killed] BooleanLiteral
src/library/interpreter.js:29:24
             const inner = this.evaluate(expression.getInner());
 
             if (expression instanceof NotExpression) {
-                return !inner;
+                return inner;
             }
 
killedBy: Interpreter Not expression Should evaluate not expression to true if inner is false
statusReason: expected false to be truthy

[Killed] BlockStatement
src/library/interpreter.js:35:53
             throw new Error('Unable to evaluate unary expression');
         }
 
-        if (expression instanceof BinaryExpression) {
-            const left = this.evaluate(expression.getLeft());
-            const right = this.evaluate(expression.getRight());
-
-            if (expression instanceof AndExpression) {
-                return left && right;
-            }
-
-            if (expression instanceof OrExpression) {
-                return left || right;
-            }
-
-            if (expression instanceof ConditionalExpression) {
-                return !left || right;
-            }
-
-            if (expression instanceof BiconditionalExpression) {
-                return (left && right) || (!left && !right);
-            }
-
-            throw new Error('Unable to evaluate binary expression');
-        }
+        if (expression instanceof BinaryExpression) {}
 
         throw new Error('Unable to evaluate expression');
killedBy: Interpreter Should throw error if binary expression is not expected
statusReason: expected [Function] to throw error including 'Unable to evaluate binary expression' but got 'Unable to evaluate expression'

[Killed] ConditionalExpression
src/library/interpreter.js:35:13
             throw new Error('Unable to evaluate unary expression');
         }
 
-        if (expression instanceof BinaryExpression) {
+        if (false) {
             const left = this.evaluate(expression.getLeft());
             const right = this.evaluate(expression.getRight());
killedBy: Interpreter Should throw error if binary expression is not expected
statusReason: expected [Function] to throw error including 'Unable to evaluate binary expression' but got 'Unable to evaluate expression'

[Killed] ConditionalExpression
src/library/interpreter.js:40:24
             const right = this.evaluate(expression.getRight());
 
             if (expression instanceof AndExpression) {
-                return left && right;
+                return true;
             }
 
killedBy: Interpreter And expression Should evaluate and expression to false if left is true and right side is false
statusReason: expected true to be falsy

[Killed] ConditionalExpression
src/library/interpreter.js:40:24
             const right = this.evaluate(expression.getRight());
 
             if (expression instanceof AndExpression) {
-                return left && right;
+                return false;
             }
 
killedBy: Interpreter And expression Should evaluate and expression to true if both sides are true
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/library/interpreter.js:43:17
                 return left && right;
             }
 
-            if (expression instanceof OrExpression) {
+            if (false) {
                 return left || right;
             }
killedBy: Interpreter Or expression Should evaluate or expression to true if both sides are true
statusReason: Unable to evaluate binary expression

[Killed] ConditionalExpression
src/library/interpreter.js:44:24
             }
 
             if (expression instanceof OrExpression) {
-                return left || right;
+                return false;
             }
 
killedBy: Interpreter Or expression Should evaluate or expression to true if both sides are true
statusReason: expected false to be truthy

[Killed] LogicalOperator
src/library/interpreter.js:44:24
             }
 
             if (expression instanceof OrExpression) {
-                return left || right;
+                return left && right;
             }
 
killedBy: Interpreter Or expression Should evaluate or expression to true if left is true and right is false
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/library/interpreter.js:48:24
             }
 
             if (expression instanceof ConditionalExpression) {
-                return !left || right;
+                return false;
             }
 
killedBy: Interpreter Conditional expression Should evaluate conditional expression to true if both sides are true
statusReason: expected false to be truthy

[Killed] BooleanLiteral
src/library/interpreter.js:48:24
             }
 
             if (expression instanceof ConditionalExpression) {
-                return !left || right;
+                return left || right;
             }
 
killedBy: Interpreter Conditional expression Should evaluate conditional expression to false if left side is true and right side is false
statusReason: expected true to be falsy

[Killed] ConditionalExpression
src/library/interpreter.js:51:17
                 return !left || right;
             }
 
-            if (expression instanceof BiconditionalExpression) {
+            if (false) {
                 return (left && right) || (!left && !right);
             }
killedBy: Interpreter Biconditional expression Should evaluate biconditional expression to true if both sides are true
statusReason: Unable to evaluate binary expression

[Killed] ConditionalExpression
src/library/interpreter.js:52:24
             }
 
             if (expression instanceof BiconditionalExpression) {
-                return (left && right) || (!left && !right);
+                return true;
             }
 
killedBy: Interpreter Biconditional expression Should evaluate biconditional expression to false if left side is true and right side is false
statusReason: expected true to be falsy

[Killed] LogicalOperator
src/library/interpreter.js:52:44
             }
 
             if (expression instanceof BiconditionalExpression) {
-                return (left && right) || (!left && !right);
+                return (left && right) || (!left || !right);
             }
 
killedBy: Interpreter Biconditional expression Should evaluate biconditional expression to false if left side is true and right side is false
statusReason: expected true to be falsy

[Killed] StringLiteral
src/library/interpreter.js:55:29
                 return (left && right) || (!left && !right);
             }
 
-            throw new Error('Unable to evaluate binary expression');
+            throw new Error("");
         }
 
killedBy: Interpreter Should throw error if binary expression is not expected
statusReason: expected [Function] to throw error including 'Unable to evaluate binary expression' but got ''
