[Killed] BlockStatement
src/library/lexer/peekable.js:2:25
 export default class PeekableLexer {
-    constructor (lexer) {
-        this.peeked = null;
-        this.lexer = lexer;
-    }
+    constructor (lexer) {}
 
     wasPeeked () {
killedBy: Peekable Lexer Should peek token twice without consume it
statusReason: Cannot read properties of undefined (reading 'next')

[Killed] BlockStatement
src/library/lexer/peekable.js:7:18
         this.lexer = lexer;
     }
 
-    wasPeeked () {
-        return this.peeked != null;
-    }
+    wasPeeked () {}
 
     wasNotPeeked () {
killedBy: Peekable Lexer Should consume token after being peeked
statusReason: expected Or{} to deeply equal Name{ name: 'x' }

[Killed] ConditionalExpression
src/library/lexer/peekable.js:8:16
     }
 
     wasPeeked () {
-        return this.peeked != null;
+        return true;
     }
 
killedBy: Peekable Lexer Should peek another token after being consumed
statusReason: expected null to deeply equal Name{ name: 'abc' }

[Killed] EqualityOperator
src/library/lexer/peekable.js:8:16
     }
 
     wasPeeked () {
-        return this.peeked != null;
+        return this.peeked == null;
     }
 
killedBy: Peekable Lexer Should consume token after being peeked
statusReason: expected Or{} to deeply equal Name{ name: 'x' }

[Killed] BlockStatement
src/library/lexer/peekable.js:11:21
         return this.peeked != null;
     }
 
-    wasNotPeeked () {
-        return this.peeked == null;
-    }
+    wasNotPeeked () {}
 
     isPeekTypeOf (type) {
killedBy: Peekable Lexer Should peek token twice without consume it
statusReason: expected null to deeply equal Name{ name: 'a' }

[Killed] EqualityOperator
src/library/lexer/peekable.js:12:16
     }
 
     wasNotPeeked () {
-        return this.peeked == null;
+        return this.peeked != null;
     }
 
killedBy: Peekable Lexer Should peek token twice without consume it
statusReason: expected null to deeply equal Name{ name: 'a' }

[Killed] ConditionalExpression
src/library/lexer/peekable.js:12:16
     }
 
     wasNotPeeked () {
-        return this.peeked == null;
+        return false;
     }
 
killedBy: Peekable Lexer Should peek token twice without consume it
statusReason: expected null to deeply equal Name{ name: 'a' }

[Killed] BlockStatement
src/library/lexer/peekable.js:15:25
         return this.peeked == null;
     }
 
-    isPeekTypeOf (type) {
-        const peeked = this.peek();
-
-        return peeked instanceof type;
-    }
+    isPeekTypeOf (type) {}
 
     peek () {
killedBy: Peekable Lexer Should check if peeked token is of specified type
statusReason: expected undefined to be truthy

[Killed] BlockStatement
src/library/lexer/peekable.js:21:13
         return peeked instanceof type;
     }
 
-    peek () {
-        if (this.wasNotPeeked()) {
-            this.peeked = this.lexer.next();
-        }
-
-        return this.peeked;
-    }
+    peek () {}
 
     take () {
killedBy: Peekable Lexer Should peek token twice without consume it
statusReason: expected undefined to deeply equal Name{ name: 'a' }

[Killed] ConditionalExpression
src/library/lexer/peekable.js:22:13
     }
 
     peek () {
-        if (this.wasNotPeeked()) {
+        if (true) {
             this.peeked = this.lexer.next();
         }
killedBy: Peekable Lexer Should peek token twice without consume it
statusReason: expected And{} to deeply equal Name{ name: 'a' }

[Killed] BlockStatement
src/library/lexer/peekable.js:22:34
     }
 
     peek () {
-        if (this.wasNotPeeked()) {
-            this.peeked = this.lexer.next();
-        }
+        if (this.wasNotPeeked()) {}
 
         return this.peeked;
killedBy: Peekable Lexer Should peek token twice without consume it
statusReason: expected null to deeply equal Name{ name: 'a' }

[Killed] BlockStatement
src/library/lexer/peekable.js:29:13
         return this.peeked;
     }
 
-    take () {
-        const peeked = this.peeked;
-
-        this.peeked = null;
-
-        return peeked;
-    }
+    take () {}
 
     next () {
killedBy: Peekable Lexer Should consume token after being peeked
statusReason: expected undefined to deeply equal Name{ name: 'x' }

[Killed] BlockStatement
src/library/lexer/peekable.js:37:13
         return peeked;
     }
 
-    next () {
-        if (this.wasPeeked()) {
-            return this.take();
-        } else {
-            return this.lexer.next();
-        }
-    }
+    next () {}
 
 }
killedBy: Peekable Lexer Should consume token after being peeked
statusReason: expected undefined to deeply equal Name{ name: 'x' }

[Killed] ConditionalExpression
src/library/lexer/peekable.js:38:13
     }
 
     next () {
-        if (this.wasPeeked()) {
+        if (false) {
             return this.take();
         } else {
killedBy: Peekable Lexer Should consume token after being peeked
statusReason: expected Or{} to deeply equal Name{ name: 'x' }

[Killed] BlockStatement
src/library/lexer/peekable.js:38:31
     }
 
     next () {
-        if (this.wasPeeked()) {
-            return this.take();
-        } else {
+        if (this.wasPeeked()) {} else {
             return this.lexer.next();
         }
killedBy: Peekable Lexer Should consume token after being peeked
statusReason: expected undefined to deeply equal Name{ name: 'x' }

[Killed] BlockStatement
src/library/lexer/peekable.js:40:16
     next () {
         if (this.wasPeeked()) {
             return this.take();
-        } else {
-            return this.lexer.next();
-        }
+        } else {}
     }
 
killedBy: Peekable Lexer Should peek another token after being consumed
statusReason: expected undefined to deeply equal Name{ name: 'abc' }
