[Killed] BlockStatement
src/library/lexer.js:41:35
     End,
 } from './tokens';
 
-export function isWhiteSpace (ch) {
-    // New line
-    return ch === '\n' ||
-    // Return
-            ch === '\r' ||
-    // Return
-            ch === '\t' ||
-    // Tab
-            ch === '\v' ||
-    // Vertical tab
-            ch === '\b' ||
-    // Backspace
-            ch === '\f' ||
-    // Form feed
-            ch === '\x20' ||
-    // Space
-            ch === '\xA0';
-    // No-break space
-}
+export function isWhiteSpace (ch) {}
 
 export function isNumber (ch) {
killedBy: Peekable Lexer Should peek another token after being consumed
statusReason: Unexpected character

[Killed] LogicalOperator
src/library/lexer.js:43:12
 
 export function isWhiteSpace (ch) {
     // New line
-    return ch === '\n' ||
-    // Return
-            ch === '\r' ||
-    // Return
-            ch === '\t' ||
-    // Tab
-            ch === '\v' ||
-    // Vertical tab
-            ch === '\b' ||
-    // Backspace
-            ch === '\f' ||
+    return (ch === '\n' ||
+// Return
+ch === '\r' ||
+// Return
+ch === '\t' ||
+// Tab
+ch === '\v' ||
+// Vertical tab
+ch === '\b') &&
+// Backspace
+ch === '\f' ||
     // Form feed
             ch === '\x20' ||
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] ConditionalExpression
src/library/lexer.js:43:12
 
 export function isWhiteSpace (ch) {
     // New line
-    return ch === '\n' ||
-    // Return
-            ch === '\r' ||
-    // Return
-            ch === '\t' ||
-    // Tab
-            ch === '\v' ||
-    // Vertical tab
-            ch === '\b' ||
-    // Backspace
-            ch === '\f' ||
-    // Form feed
-            ch === '\x20' ||
-    // Space
-            ch === '\xA0';
+    return false;
     // No-break space
 }
killedBy: Peekable Lexer Should peek another token after being consumed
statusReason: Unexpected character

[Killed] ConditionalExpression
src/library/lexer.js:45:13
     // New line
     return ch === '\n' ||
     // Return
-            ch === '\r' ||
+            false ||
     // Return
             ch === '\t' ||
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] EqualityOperator
src/library/lexer.js:45:13
     // New line
     return ch === '\n' ||
     // Return
-            ch === '\r' ||
+            // Return
+ch !== '\r' ||
     // Return
             ch === '\t' ||
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] EqualityOperator
src/library/lexer.js:47:13
     // Return
             ch === '\r' ||
     // Return
-            ch === '\t' ||
+            // Return
+ch !== '\t' ||
     // Tab
             ch === '\v' ||
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] ConditionalExpression
src/library/lexer.js:47:13
     // Return
             ch === '\r' ||
     // Return
-            ch === '\t' ||
+            false ||
     // Tab
             ch === '\v' ||
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] EqualityOperator
src/library/lexer.js:49:13
     // Return
             ch === '\t' ||
     // Tab
-            ch === '\v' ||
+            // Tab
+ch !== '\v' ||
     // Vertical tab
             ch === '\b' ||
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] ConditionalExpression
src/library/lexer.js:49:13
     // Return
             ch === '\t' ||
     // Tab
-            ch === '\v' ||
+            false ||
     // Vertical tab
             ch === '\b' ||
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] ConditionalExpression
src/library/lexer.js:51:13
     // Tab
             ch === '\v' ||
     // Vertical tab
-            ch === '\b' ||
+            false ||
     // Backspace
             ch === '\f' ||
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] EqualityOperator
src/library/lexer.js:51:13
     // Tab
             ch === '\v' ||
     // Vertical tab
-            ch === '\b' ||
+            // Vertical tab
+ch !== '\b' ||
     // Backspace
             ch === '\f' ||
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] EqualityOperator
src/library/lexer.js:53:13
     // Vertical tab
             ch === '\b' ||
     // Backspace
-            ch === '\f' ||
+            // Backspace
+ch !== '\f' ||
     // Form feed
             ch === '\x20' ||
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] ConditionalExpression
src/library/lexer.js:53:13
     // Vertical tab
             ch === '\b' ||
     // Backspace
-            ch === '\f' ||
+            false ||
     // Form feed
             ch === '\x20' ||
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] EqualityOperator
src/library/lexer.js:55:13
     // Backspace
             ch === '\f' ||
     // Form feed
-            ch === '\x20' ||
+            // Form feed
+ch !== '\x20' ||
     // Space
             ch === '\xA0';
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] ConditionalExpression
src/library/lexer.js:55:13
     // Backspace
             ch === '\f' ||
     // Form feed
-            ch === '\x20' ||
+            false ||
     // Space
             ch === '\xA0';
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] EqualityOperator
src/library/lexer.js:57:13
     // Form feed
             ch === '\x20' ||
     // Space
-            ch === '\xA0';
+            // Space
+ch !== '\xA0';
     // No-break space
 }
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] ConditionalExpression
src/library/lexer.js:57:13
     // Form feed
             ch === '\x20' ||
     // Space
-            ch === '\xA0';
+            false;
     // No-break space
 }
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] BlockStatement
src/library/lexer.js:61:31
     // No-break space
 }
 
-export function isNumber (ch) {
-    // eslint-disable-next-line no-magic-numbers
-    return (typeof ch === 'string' && ch.length === 1) && (ch >= '0' && ch <= '9');
-}
+export function isNumber (ch) {}
 
 export function isAlphabetic (ch) {
killedBy: Check number
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/library/lexer.js:63:39
 
 export function isNumber (ch) {
     // eslint-disable-next-line no-magic-numbers
-    return (typeof ch === 'string' && ch.length === 1) && (ch >= '0' && ch <= '9');
+    return (typeof ch === 'string' && true) && (ch >= '0' && ch <= '9');
 }
 
killedBy: Check double digit number
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/library/lexer.js:63:60
 
 export function isNumber (ch) {
     // eslint-disable-next-line no-magic-numbers
-    return (typeof ch === 'string' && ch.length === 1) && (ch >= '0' && ch <= '9');
+    return (typeof ch === 'string' && ch.length === 1) && (true);
 }
 
killedBy: Generator Should generate table
statusReason: expected [ [ 'a & b -> c' ], …(1) ] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/library/lexer.js:66:35
     return (typeof ch === 'string' && ch.length === 1) && (ch >= '0' && ch <= '9');
 }
 
-export function isAlphabetic (ch) {
-    return (ch >= 'a' && ch <= 'z') || (ch >= 'A' && ch <= 'Z');
-}
+export function isAlphabetic (ch) {}
 
 export default class Lexer {
killedBy: Check LowerCase alphabetic
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/library/lexer.js:67:12
 }
 
 export function isAlphabetic (ch) {
-    return (ch >= 'a' && ch <= 'z') || (ch >= 'A' && ch <= 'Z');
+    return false;
 }
 
killedBy: Check LowerCase alphabetic
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/library/lexer.js:67:41
 }
 
 export function isAlphabetic (ch) {
-    return (ch >= 'a' && ch <= 'z') || (ch >= 'A' && ch <= 'Z');
+    return (ch >= 'a' && ch <= 'z') || (false);
 }
 
killedBy: Check UpperCase alphabetic
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/library/lexer.js:71:26
 }
 
 export default class Lexer {
-    constructor (source) {
-        this.source = source;
-    }
+    constructor (source) {}
 
     // eslint-disable-next-line max-lines-per-function, max-statements, complexity
killedBy: Generator Should generate table
statusReason: Cannot read properties of undefined (reading 'skipWhile')

[Killed] ConditionalExpression
src/library/lexer.js:84:13
         switch (ch) {
             case TILDE:
             case EXCLAMATION:
-            case LOGICAL_NOT:
-                this.source.bump();
-
-                return new Not();
+            case LOGICAL_NOT:
 
             case CARET:
killedBy: Check Next not()
statusReason: expected And{} to be an instance of Not

[Killed] ConditionalExpression
src/library/lexer.js:92:13
             case CARET:
             case ASTERISK:
             case AMPERSAND:
-            case LOGICAL_AND:
-                this.source.bump();
-
-                return new And();
+            case LOGICAL_AND:
 
             case PLUS:
killedBy: Generator Should generate table
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/library/lexer.js:99:13
 
             case PLUS:
             case VERTICAL_LINE:
-            case LOGICAL_OR:
-                this.source.bump();
-
-                return new Or();
+            case LOGICAL_OR:
 
             case RIGHTWARDS_ARROW:
killedBy: Check Next Or()
statusReason: expected Conditional{} to be an instance of Or

[Killed] ConditionalExpression
src/library/lexer.js:105:13
                 return new Or();
 
             case RIGHTWARDS_ARROW:
-            case RIGHTWARDS_DOUBLE_ARROW:
-                this.source.bump();
-
-                return new Conditional();
+            case RIGHTWARDS_DOUBLE_ARROW:
 
             case LEFT_RIGHT_ARROW:
killedBy: Check Next Conditional()
statusReason: expected Biconditional{} to be an instance of Conditional

[Killed] ConditionalExpression
src/library/lexer.js:111:13
                 return new Conditional();
 
             case LEFT_RIGHT_ARROW:
-            case LEFT_RIGHT_DOUBLE_ARROW:
-                this.source.bump();
-
-                return new Biconditional();
+            case LEFT_RIGHT_DOUBLE_ARROW:
 
             case OPENING_PARENTHESIS:
killedBy: Check Next Biconditional()
statusReason: expected OpeningParenthesis{} to be an instance of Biconditional

[Killed] ConditionalExpression
src/library/lexer.js:116:13
 
                 return new Biconditional();
 
-            case OPENING_PARENTHESIS:
-                this.source.bump();
-
-                return new OpeningParenthesis();
+            case OPENING_PARENTHESIS:
 
             case CLOSING_PARENTHESIS:
killedBy: Check Next OpeningParenthesis()
statusReason: expected ClosingParenthesis{} to be an instance of OpeningParenthesis

[Killed] ConditionalExpression
src/library/lexer.js:121:13
 
                 return new OpeningParenthesis();
 
-            case CLOSING_PARENTHESIS:
-                this.source.bump();
-
-                return new ClosingParenthesis();
+            case CLOSING_PARENTHESIS:
 
             default:
killedBy: Check Next ClosingParenthesis()
statusReason: Unexpected character

[Killed] EqualityOperator
src/library/lexer.js:127:36
                 return new ClosingParenthesis();
 
             default:
-                if (ch === null || ch === undefined) {
+                if (ch === null || ch !== undefined) {
                     return new End();
                 }
killedBy: Check Next End()
statusReason: Unexpected character

[Killed] LogicalOperator
src/library/lexer.js:127:21
                 return new ClosingParenthesis();
 
             default:
-                if (ch === null || ch === undefined) {
+                if (ch === null && ch === undefined) {
                     return new End();
                 }
killedBy: Check Next End()
statusReason: Unexpected character

[Killed] EqualityOperator
src/library/lexer.js:131:21
                     return new End();
                 }
 
-                if (ch === '<') {
+                if (ch !== '<') {
                     this.source.bump();
 
killedBy: Check Next Biconditional() <->
statusReason: Unexpected character

[Killed] ConditionalExpression
src/library/lexer.js:131:21
                     return new End();
                 }
 
-                if (ch === '<') {
+                if (true) {
                     this.source.bump();
 
killedBy: Check Next Conditional() <->
statusReason: Unexpected character

[Killed] ConditionalExpression
src/library/lexer.js:134:25
                 if (ch === '<') {
                     this.source.bump();
 
-                    if (this.source.peek() === '-') {
+                    if (false) {
                         this.source.bump();
 
killedBy: Check Next Biconditional() <->
statusReason: Unexpected character

[Killed] BlockStatement
src/library/lexer.js:134:53
                 if (ch === '<') {
                     this.source.bump();
 
-                    if (this.source.peek() === '-') {
-                        this.source.bump();
-
-                        if (this.source.peek() === '>') {
-                            this.source.bump();
-
-                            return new Biconditional();
-                        }
-                    }
+                    if (this.source.peek() === '-') {}
                 } else if (ch === '-') {
                     this.source.bump();
killedBy: Check Next Biconditional() <->
statusReason: Unexpected character

[Killed] EqualityOperator
src/library/lexer.js:137:29
                     if (this.source.peek() === '-') {
                         this.source.bump();
 
-                        if (this.source.peek() === '>') {
+                        if (this.source.peek() !== '>') {
                             this.source.bump();
 
killedBy: Check Next Biconditional() <->
statusReason: Unexpected character

[Killed] ConditionalExpression
src/library/lexer.js:137:29
                     if (this.source.peek() === '-') {
                         this.source.bump();
 
-                        if (this.source.peek() === '>') {
+                        if (false) {
                             this.source.bump();
 
killedBy: Check Next Biconditional() <->
statusReason: Unexpected character

[Killed] EqualityOperator
src/library/lexer.js:143:28
                             return new Biconditional();
                         }
                     }
-                } else if (ch === '-') {
+                } else if (ch !== '-') {
                     this.source.bump();
 
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] BlockStatement
src/library/lexer.js:143:40
                             return new Biconditional();
                         }
                     }
-                } else if (ch === '-') {
-                    this.source.bump();
-
-                    if (this.source.peek() === '>') {
-                        this.source.bump();
-
-                        return new Conditional();
-                    }
-                } else if (isAlphabetic(ch)) {
+                } else if (ch === '-') {} else if (isAlphabetic(ch)) {
                     // eslint-disable-next-line no-shadow
                     const name = this.source.takeWhile((ch) => isAlphabetic(ch) || isNumber(ch));
killedBy: Lexer Token Conditional Should consume -> as conditional token
statusReason: Unexpected character

[Killed] ConditionalExpression
src/library/lexer.js:146:25
                 } else if (ch === '-') {
                     this.source.bump();
 
-                    if (this.source.peek() === '>') {
+                    if (true) {
                         this.source.bump();
 
killedBy: Lexer Token Conditional Should throw error if only - was found
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/library/lexer.js:151:28
 
                         return new Conditional();
                     }
-                } else if (isAlphabetic(ch)) {
+                } else if (true) {
                     // eslint-disable-next-line no-shadow
                     const name = this.source.takeWhile((ch) => isAlphabetic(ch) || isNumber(ch));
killedBy: Lexer Token Name Should throw error if name token starts with numeric characters
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/library/lexer.js:151:28
 
                         return new Conditional();
                     }
-                } else if (isAlphabetic(ch)) {
+                } else if (false) {
                     // eslint-disable-next-line no-shadow
                     const name = this.source.takeWhile((ch) => isAlphabetic(ch) || isNumber(ch));
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Killed] ArrowFunction
src/library/lexer.js:153:56
                     }
                 } else if (isAlphabetic(ch)) {
                     // eslint-disable-next-line no-shadow
-                    const name = this.source.takeWhile((ch) => isAlphabetic(ch) || isNumber(ch));
+                    const name = this.source.takeWhile(() => undefined);
 
                     return new Name(name);
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: expected Name{ name: '' } to deeply equal Name{ name: 'abc' }

[Killed] LogicalOperator
src/library/lexer.js:153:64
                     }
                 } else if (isAlphabetic(ch)) {
                     // eslint-disable-next-line no-shadow
-                    const name = this.source.takeWhile((ch) => isAlphabetic(ch) || isNumber(ch));
+                    const name = this.source.takeWhile((ch) => isAlphabetic(ch) && isNumber(ch));
 
                     return new Name(name);
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: expected Name{ name: '' } to deeply equal Name{ name: 'abc' }
