[Killed] BlockStatement
src/library/parser.js:29:25
 } from './expressions';
 
 export default class Parser {
-    constructor (lexer) {
-        this.lexer = lexer;
-    }
+    constructor (lexer) {}
 
     check (type) {
killedBy: Generator Should generate table
statusReason: Cannot read properties of undefined (reading 'isPeekTypeOf')

[Killed] BlockStatement
src/library/parser.js:33:18
         this.lexer = lexer;
     }
 
-    check (type) {
-        return this.lexer.isPeekTypeOf(type);
-    }
+    check (type) {}
 
     match (type) {
killedBy: Generator Should generate table
statusReason: Expected name

[Killed] BlockStatement
src/library/parser.js:37:18
         return this.lexer.isPeekTypeOf(type);
     }
 
-    match (type) {
-        if (this.check(type)) {
-            return this.lexer.next();
-        }
-    }
+    match (type) {}
 
     parse () {
killedBy: Generator Should generate table
statusReason: Expected name

[Killed] BlockStatement
src/library/parser.js:38:31
     }
 
     match (type) {
-        if (this.check(type)) {
-            return this.lexer.next();
-        }
+        if (this.check(type)) {}
     }
 
killedBy: Generator Should generate table
statusReason: Expected name

[Killed] ConditionalExpression
src/library/parser.js:38:13
     }
 
     match (type) {
-        if (this.check(type)) {
+        if (false) {
             return this.lexer.next();
         }
killedBy: Generator Should generate table
statusReason: Expected name

[Killed] BlockStatement
src/library/parser.js:43:14
         }
     }
 
-    parse () {
-        const expression = this.parseBiconditionalExpression();
-
-        if (this.check(End)) {
-            return expression;
-        }
-
-        throw new Error('Expected end');
-    }
+    parse () {}
 
     parseBiconditionalExpression () {
killedBy: Generator Should generate table
statusReason: Unexpected expression

[Killed] BlockStatement
src/library/parser.js:46:30
     parse () {
         const expression = this.parseBiconditionalExpression();
 
-        if (this.check(End)) {
-            return expression;
-        }
+        if (this.check(End)) {}
 
         throw new Error('Expected end');
killedBy: Generator Should generate table
statusReason: Expected end

[Killed] ConditionalExpression
src/library/parser.js:46:13
     parse () {
         const expression = this.parseBiconditionalExpression();
 
-        if (this.check(End)) {
+        if (false) {
             return expression;
         }
killedBy: Generator Should generate table
statusReason: Expected end

[Killed] BlockStatement
src/library/parser.js:53:37
         throw new Error('Expected end');
     }
 
-    parseBiconditionalExpression () {
-        const expression = this.parseConditionalExpression();
-
-        if (this.match(Biconditional)) {
-            return new BiconditionalExpression(expression, this.parseBiconditionalExpression());
-        }
-
-        return expression;
-    }
+    parseBiconditionalExpression () {}
 
     parseConditionalExpression () {
killedBy: Generator Should generate table
statusReason: Expected end

[Killed] ConditionalExpression
src/library/parser.js:56:13
     parseBiconditionalExpression () {
         const expression = this.parseConditionalExpression();
 
-        if (this.match(Biconditional)) {
+        if (true) {
             return new BiconditionalExpression(expression, this.parseBiconditionalExpression());
         }
killedBy: Parser Should throw error if end token is not found
statusReason: expected [Function] to throw error including 'Expected end' but got 'Unexpected end'

[Killed] ConditionalExpression
src/library/parser.js:56:13
     parseBiconditionalExpression () {
         const expression = this.parseConditionalExpression();
 
-        if (this.match(Biconditional)) {
+        if (false) {
             return new BiconditionalExpression(expression, this.parseBiconditionalExpression());
         }
killedBy: Parser Expression Should parse biconditional expression
statusReason: Expected end

[Killed] BlockStatement
src/library/parser.js:63:35
         return expression;
     }
 
-    parseConditionalExpression () {
-        const expression = this.parseOrExpression();
-
-        if (this.match(Conditional)) {
-            return new ConditionalExpression(expression, this.parseConditionalExpression());
-        }
-
-        return expression;
-    }
+    parseConditionalExpression () {}
 
     parseOrExpression () {
killedBy: Parser Should throw error if no token is found
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/library/parser.js:66:13
     parseConditionalExpression () {
         const expression = this.parseOrExpression();
 
-        if (this.match(Conditional)) {
+        if (false) {
             return new ConditionalExpression(expression, this.parseConditionalExpression());
         }
killedBy: Parser Expression Should parse conditional expression
statusReason: Expected end

[Killed] BlockStatement
src/library/parser.js:66:38
     parseConditionalExpression () {
         const expression = this.parseOrExpression();
 
-        if (this.match(Conditional)) {
-            return new ConditionalExpression(expression, this.parseConditionalExpression());
-        }
+        if (this.match(Conditional)) {}
 
         return expression;
killedBy: Parser Expression Should parse conditional expression
statusReason: Expected end

[Killed] BlockStatement
src/library/parser.js:73:26
         return expression;
     }
 
-    parseOrExpression () {
-        const expression = this.parseAndExpression();
-
-        if (this.match(Or)) {
-            return new OrExpression(expression, this.parseOrExpression());
-        }
-
-        return expression;
-    }
+    parseOrExpression () {}
 
     parseAndExpression () {
killedBy: Parser Should throw error if no token is found
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/library/parser.js:76:13
     parseOrExpression () {
         const expression = this.parseAndExpression();
 
-        if (this.match(Or)) {
+        if (false) {
             return new OrExpression(expression, this.parseOrExpression());
         }
killedBy: Parser Expression Should parse or expression
statusReason: Expected end

[Killed] BlockStatement
src/library/parser.js:76:29
     parseOrExpression () {
         const expression = this.parseAndExpression();
 
-        if (this.match(Or)) {
-            return new OrExpression(expression, this.parseOrExpression());
-        }
+        if (this.match(Or)) {}
 
         return expression;
killedBy: Parser Expression Should parse or expression
statusReason: Expected end

[Killed] BlockStatement
src/library/parser.js:83:27
         return expression;
     }
 
-    parseAndExpression () {
-        const expression = this.parseNotExpression();
-
-        if (this.match(And)) {
-            return new AndExpression(expression, this.parseAndExpression());
-        }
-
-        return expression;
-    }
+    parseAndExpression () {}
 
     parseNotExpression () {
killedBy: Parser Should throw error if no token is found
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/library/parser.js:86:30
     parseAndExpression () {
         const expression = this.parseNotExpression();
 
-        if (this.match(And)) {
-            return new AndExpression(expression, this.parseAndExpression());
-        }
+        if (this.match(And)) {}
 
         return expression;
killedBy: Parser Should throw error if token was not expected
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/library/parser.js:86:13
     parseAndExpression () {
         const expression = this.parseNotExpression();
 
-        if (this.match(And)) {
+        if (false) {
             return new AndExpression(expression, this.parseAndExpression());
         }
killedBy: Parser Should throw error if token was not expected
statusReason: expected [Function] to throw error including 'Unexpected token' but got 'Expected end'

[Killed] BlockStatement
src/library/parser.js:93:27
         return expression;
     }
 
-    parseNotExpression () {
-        if (this.match(Not)) {
-            return new NotExpression(this.parseNotExpression());
-        }
-
-        return this.parsePrimaryExpression();
-    }
+    parseNotExpression () {}
 
     parsePrimaryExpression () {
killedBy: Parser Should throw error if no token is found
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/library/parser.js:94:30
     }
 
     parseNotExpression () {
-        if (this.match(Not)) {
-            return new NotExpression(this.parseNotExpression());
-        }
+        if (this.match(Not)) {}
 
         return this.parsePrimaryExpression();
killedBy: Parser Expression Should parse not expression
statusReason: expected NameExpression{ name: 'f' } to deeply equal NotExpression{ …(1) }

[Killed] ConditionalExpression
src/library/parser.js:94:13
     }
 
     parseNotExpression () {
-        if (this.match(Not)) {
+        if (false) {
             return new NotExpression(this.parseNotExpression());
         }
killedBy: Parser Expression Should parse not expression
statusReason: Unexpected token

[Killed] BlockStatement
src/library/parser.js:101:31
         return this.parsePrimaryExpression();
     }
 
-    parsePrimaryExpression () {
-        const token = this.lexer.peek();
-
-        if (token instanceof OpeningParenthesis) {
-            return this.parseParenthesisExpression();
-        }
-
-        if (token instanceof Name) {
-            return this.parseNameExpression();
-        }
-
-        if (token instanceof End) {
-            throw new Error('Unexpected end');
-        }
-
-        throw new Error('Unexpected token');
-    }
+    parsePrimaryExpression () {}
 
     parseParenthesisExpression () {
killedBy: Parser Should throw error if no token is found
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/library/parser.js:104:13
     parsePrimaryExpression () {
         const token = this.lexer.peek();
 
-        if (token instanceof OpeningParenthesis) {
+        if (false) {
             return this.parseParenthesisExpression();
         }
killedBy: Parser Expression Should parse parenthesized expression
statusReason: Unexpected token

[Killed] ConditionalExpression
src/library/parser.js:104:13
     parsePrimaryExpression () {
         const token = this.lexer.peek();
 
-        if (token instanceof OpeningParenthesis) {
+        if (true) {
             return this.parseParenthesisExpression();
         }
killedBy: Parser Should throw error if end token is not found
statusReason: expected [Function] to throw error including 'Expected end' but got 'Expected opening parenthesis'

[Killed] ConditionalExpression
src/library/parser.js:108:13
             return this.parseParenthesisExpression();
         }
 
-        if (token instanceof Name) {
+        if (false) {
             return this.parseNameExpression();
         }
killedBy: Parser Should throw error if end token is not found
statusReason: expected [Function] to throw error including 'Expected end' but got 'Unexpected token'

[Killed] ConditionalExpression
src/library/parser.js:108:13
             return this.parseParenthesisExpression();
         }
 
-        if (token instanceof Name) {
+        if (true) {
             return this.parseNameExpression();
         }
killedBy: Parser Should throw error if no token is found
statusReason: expected [Function] to throw error including 'Unexpected end' but got 'Expected name'

[Killed] ConditionalExpression
src/library/parser.js:112:13
             return this.parseNameExpression();
         }
 
-        if (token instanceof End) {
+        if (false) {
             throw new Error('Unexpected end');
         }
killedBy: Parser Should throw error if no token is found
statusReason: expected [Function] to throw error including 'Unexpected end' but got 'Unexpected token'

[Killed] ConditionalExpression
src/library/parser.js:112:13
             return this.parseNameExpression();
         }
 
-        if (token instanceof End) {
+        if (true) {
             throw new Error('Unexpected end');
         }
killedBy: Parser Should throw error if token was not expected
statusReason: expected [Function] to throw error including 'Unexpected token' but got 'Unexpected end'

[Killed] StringLiteral
src/library/parser.js:113:29
         }
 
         if (token instanceof End) {
-            throw new Error('Unexpected end');
+            throw new Error("");
         }
 
killedBy: Parser Should throw error if no token is found
statusReason: expected [Function] to throw error including 'Unexpected end' but got ''

[Killed] StringLiteral
src/library/parser.js:116:25
             throw new Error('Unexpected end');
         }
 
-        throw new Error('Unexpected token');
+        throw new Error("");
     }
 
killedBy: Parser Should throw error if token was not expected
statusReason: expected [Function] to throw error including 'Unexpected token' but got ''

[Killed] BlockStatement
src/library/parser.js:119:35
         throw new Error('Unexpected token');
     }
 
-    parseParenthesisExpression () {
-        if (!this.match(OpeningParenthesis)) {
-            throw new Error('Expected opening parenthesis');
-        }
-
-        const expression = this.parseBiconditionalExpression();
-
-        if (!this.match(ClosingParenthesis)) {
-            throw new Error('Expected closing parenthesis');
-        }
-
-        return expression;
-    }
+    parseParenthesisExpression () {}
 
     parseNameExpression () {
killedBy: Parser Expression Should parse parenthesized expression
statusReason: Expected end

[Killed] BlockStatement
src/library/parser.js:120:46
     }
 
     parseParenthesisExpression () {
-        if (!this.match(OpeningParenthesis)) {
-            throw new Error('Expected opening parenthesis');
-        }
+        if (!this.match(OpeningParenthesis)) {}
 
         const expression = this.parseBiconditionalExpression();
killedBy: Parser Expression Should throw error if parenthesized expression was not opened
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/library/parser.js:120:13
     }
 
     parseParenthesisExpression () {
-        if (!this.match(OpeningParenthesis)) {
+        if (this.match(OpeningParenthesis)) {
             throw new Error('Expected opening parenthesis');
         }
killedBy: Parser Expression Should parse parenthesized expression
statusReason: Expected opening parenthesis

[Killed] BlockStatement
src/library/parser.js:126:46
 
         const expression = this.parseBiconditionalExpression();
 
-        if (!this.match(ClosingParenthesis)) {
-            throw new Error('Expected closing parenthesis');
-        }
+        if (!this.match(ClosingParenthesis)) {}
 
         return expression;
killedBy: Parser Expression Should throw error if parenthesized expression was not closed
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/library/parser.js:126:13
 
         const expression = this.parseBiconditionalExpression();
 
-        if (!this.match(ClosingParenthesis)) {
+        if (false) {
             throw new Error('Expected closing parenthesis');
         }
killedBy: Parser Expression Should parse parenthesized expression
statusReason: Expected end

[Killed] BlockStatement
src/library/parser.js:133:28
         return expression;
     }
 
-    parseNameExpression () {
-        const name = this.match(Name);
-
-        if (name) {
-            return new NameExpression(name.getName());
-        } else {
-            throw new Error('Expected name');
-        }
-    }
+    parseNameExpression () {}
 }
 
killedBy: Parser Should throw error if token was not expected
statusReason: expected [Function] to throw error including 'Unexpected token' but got 'Expected end'

[Killed] ConditionalExpression
src/library/parser.js:136:13
     parseNameExpression () {
         const name = this.match(Name);
 
-        if (name) {
+        if (false) {
             return new NameExpression(name.getName());
         } else {
killedBy: Parser Should throw error if end token is not found
statusReason: expected [Function] to throw error including 'Expected end' but got 'Expected name'

[Killed] ConditionalExpression
src/library/parser.js:136:13
     parseNameExpression () {
         const name = this.match(Name);
 
-        if (name) {
+        if (true) {
             return new NameExpression(name.getName());
         } else {
killedBy: Parser Expression Should throw error if name token is not found
statusReason: expected [Function] to throw error including 'Expected name' but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/library/parser.js:138:16
 
         if (name) {
             return new NameExpression(name.getName());
-        } else {
-            throw new Error('Expected name');
-        }
+        } else {}
     }
 }
killedBy: Parser Expression Should throw error if name token is not found
statusReason: expected [Function] to throw an error
