[Killed] BlockStatement
src/library/source.js:2:25
 export default class Source {
-    constructor (input) {
-        this.offset = 0;
-        this.input = input;
-    }
+    constructor (input) {}
 
     span (start, end) {
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: this.input is not iterable

[Killed] BlockStatement
src/library/source.js:7:23
         this.input = input;
     }
 
-    span (start, end) {
-        return this.input.slice(
-            start,
-            end,
-        );
-    }
+    span (start, end) {}
 
     peek () {
killedBy: Parser Expression Should parse biconditional expression
statusReason: expected BiconditionalExpression{ …(2) } to deeply equal ConditionalExpression{ …(2) }

[Killed] MethodExpression
src/library/source.js:8:16
     }
 
     span (start, end) {
-        return this.input.slice(
-            start,
-            end,
-        );
+        return this.input;
     }
 
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: expected Name{ name: '\n\r\t\u000b\b\f  abc' } to deeply equal Name{ name: 'abc' }

[Killed] BlockStatement
src/library/source.js:14:13
         );
     }
 
-    peek () {
-        return [...this.input][this.offset];
-    }
+    peek () {}
 
     bump () {
killedBy: Parser Should throw error if end token is not found
statusReason: expected [Function] to throw error including 'Expected end' but got 'Unexpected end'

[Timeout] BlockStatement
src/library/source.js:18:13
         return [...this.input][this.offset];
     }
 
-    bump () {
-        this.offset += 1;
-    }
+    bump () {}
 
     takeWhile (fn) {

[Killed] AssignmentOperator
src/library/source.js:19:9
     }
 
     bump () {
-        this.offset += 1;
+        this.offset -= 1;
     }
 
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: expected End{} to deeply equal Name{ name: 'abc' }

[Killed] BlockStatement
src/library/source.js:22:20
         this.offset += 1;
     }
 
-    takeWhile (fn) {
-        const start = this.offset;
-
-        this.skipWhile(fn);
-
-        const end = this.offset;
-
-        return this.span(
-            start,
-            end,
-        );
-    }
+    takeWhile (fn) {}
 
     skipWhile (fn) {
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: expected Name{ name: undefined } to deeply equal Name{ name: 'abc' }

[Killed] BlockStatement
src/library/source.js:35:20
         );
     }
 
-    skipWhile (fn) {
-        while (fn(this.peek())) {
-            this.bump();
-        }
-    }
+    skipWhile (fn) {}
 }
 
killedBy: Parser Should throw error if token was not expected
statusReason: expected [Function] to throw error including 'Unexpected token' but got 'Expected end'

[Killed] ConditionalExpression
src/library/source.js:36:16
     }
 
     skipWhile (fn) {
-        while (fn(this.peek())) {
+        while (false) {
             this.bump();
         }
killedBy: Lexer Token Whitespace Should skip all whitespaces
statusReason: Unexpected character

[Timeout] BlockStatement
src/library/source.js:36:33
     }
 
     skipWhile (fn) {
-        while (fn(this.peek())) {
-            this.bump();
-        }
+        while (fn(this.peek())) {}
     }
 }
