[Killed] BlockStatement
src/library/tokens.js:2:24
 export class Name {
-    constructor (name) {
-        this.name = name;
-    }
+    constructor (name) {}
 
     getName () {
killedBy: Generator Should generate table
statusReason: expected [ [ undefined, …(2) ], …(1) ] to deeply equal [ …(2) ]
