[Killed] StringLiteral
src/library/characters.js:3:28
 export const TILDE = '~';
 export const EXCLAMATION = '!';
-export const LOGICAL_NOT = '¬';
+export const LOGICAL_NOT = "";
 
 export const CARET = '^';
killedBy: Lexer Token Not Should consume ¬ as not token
statusReason: Unexpected character

[Killed] StringLiteral
src/library/characters.js:5:22
 export const EXCLAMATION = '!';
 export const LOGICAL_NOT = '¬';
 
-export const CARET = '^';
+export const CARET = "";
 export const ASTERISK = '*';
 export const AMPERSAND = '&';
killedBy: Lexer Token And Should consume ^ as and token
statusReason: Unexpected character

[Killed] StringLiteral
src/library/characters.js:10:21
 export const AMPERSAND = '&';
 export const LOGICAL_AND = '∧';
 
-export const PLUS = '+';
+export const PLUS = "";
 export const VERTICAL_LINE = '|';
 export const LOGICAL_OR = '∨';
killedBy: Lexer Token Or Should consume + as or token
statusReason: Unexpected character

[Killed] StringLiteral
src/library/characters.js:12:27
 
 export const PLUS = '+';
 export const VERTICAL_LINE = '|';
-export const LOGICAL_OR = '∨';
+export const LOGICAL_OR = "";
 
 export const RIGHTWARDS_ARROW = '→';
killedBy: Lexer Token Or Should consume ∨ as or token
statusReason: Unexpected character

[Killed] StringLiteral
src/library/characters.js:14:33
 export const VERTICAL_LINE = '|';
 export const LOGICAL_OR = '∨';
 
-export const RIGHTWARDS_ARROW = '→';
+export const RIGHTWARDS_ARROW = "";
 export const RIGHTWARDS_DOUBLE_ARROW = '⇒';
 
killedBy: Lexer Token Conditional Should consume → as conditional token
statusReason: Unexpected character

[Killed] StringLiteral
src/library/characters.js:15:40
 export const LOGICAL_OR = '∨';
 
 export const RIGHTWARDS_ARROW = '→';
-export const RIGHTWARDS_DOUBLE_ARROW = '⇒';
+export const RIGHTWARDS_DOUBLE_ARROW = "";
 
 export const LEFT_RIGHT_ARROW = '↔';
killedBy: Lexer Token Conditional Should consume ⇒ as conditional token
statusReason: Unexpected character

[Killed] StringLiteral
src/library/characters.js:17:33
 export const RIGHTWARDS_ARROW = '→';
 export const RIGHTWARDS_DOUBLE_ARROW = '⇒';
 
-export const LEFT_RIGHT_ARROW = '↔';
+export const LEFT_RIGHT_ARROW = "";
 export const LEFT_RIGHT_DOUBLE_ARROW = '⇔';
 
killedBy: Lexer Token Biconditional Should consume ↔ as biconditional token
statusReason: Unexpected character

[Killed] StringLiteral
src/library/characters.js:20:36
 export const LEFT_RIGHT_ARROW = '↔';
 export const LEFT_RIGHT_DOUBLE_ARROW = '⇔';
 
-export const OPENING_PARENTHESIS = '(';
+export const OPENING_PARENTHESIS = "";
 export const CLOSING_PARENTHESIS = ')';
 
killedBy: Lexer Token Parenthesis Should consume ( as opening parenthesis token
statusReason: Unexpected character
