[Killed] BlockStatement
library/generator/expressions/sorter.js:4:42
 import { NameExpression } from '../../expressions';
 
 export default class ExpressionsSorter {
-    getExpressionPrecedence (expression) {
-        if (expression instanceof NameExpression) {
-            return 0;
-        } else {
-            return 1;
-        }
-    }
+    getExpressionPrecedence (expression) {}
 
     sort (expressions) {
killedBy: Generator Should generate table
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
library/generator/expressions/sorter.js:5:13
 
 export default class ExpressionsSorter {
     getExpressionPrecedence (expression) {
-        if (expression instanceof NameExpression) {
+        if (false) {
             return 0;
         } else {
killedBy: Expression sorted Should sort expressions
statusReason: expected [ NameExpression{ name: 'a' }, …(5) ] to deeply equal [ NameExpression{ name: 'a' }, …(5) ]

[Killed] BlockStatement
library/generator/expressions/sorter.js:5:51
 
 export default class ExpressionsSorter {
     getExpressionPrecedence (expression) {
-        if (expression instanceof NameExpression) {
-            return 0;
-        } else {
+        if (expression instanceof NameExpression) {} else {
             return 1;
         }
killedBy: Generator Should generate table
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] BlockStatement
library/generator/expressions/sorter.js:7:16
     getExpressionPrecedence (expression) {
         if (expression instanceof NameExpression) {
             return 0;
-        } else {
-            return 1;
-        }
+        } else {}
     }
 
killedBy: Expression sorted Should sort expressions
statusReason: expected [ NameExpression{ name: 'a' }, …(5) ] to deeply equal [ NameExpression{ name: 'a' }, …(5) ]

[Killed] BlockStatement
library/generator/expressions/sorter.js:12:24
         }
     }
 
-    sort (expressions) {
-        return expressions.slice()
-            .sort((expressionA, expressionB) => {
-                const precedenceExpressionA = this.getExpressionPrecedence(expressionA);
-                const precedenceExpressionB = this.getExpressionPrecedence(expressionB);
-
-                return precedenceExpressionA - precedenceExpressionB;
-            });
-    }
+    sort (expressions) {}
 }
killedBy: Generator Should generate table
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
library/generator/expressions/sorter.js:13:16
     }
 
     sort (expressions) {
-        return expressions.slice()
-            .sort((expressionA, expressionB) => {
-                const precedenceExpressionA = this.getExpressionPrecedence(expressionA);
-                const precedenceExpressionB = this.getExpressionPrecedence(expressionB);
-
-                return precedenceExpressionA - precedenceExpressionB;
-            });
+        return expressions.slice();
     }
 }
killedBy: Expression sorted Should sort expressions
statusReason: expected [ NameExpression{ name: 'a' }, …(5) ] to deeply equal [ NameExpression{ name: 'a' }, …(5) ]

[Killed] MethodExpression
library/generator/expressions/sorter.js:13:16
     }
 
     sort (expressions) {
-        return expressions.slice()
+        return expressions
             .sort((expressionA, expressionB) => {
                 const precedenceExpressionA = this.getExpressionPrecedence(expressionA);
killedBy: Expression sorted Should sort expressions
statusReason: expected [ NameExpression{ name: 'a' }, …(1) ] not to be [ NameExpression{ name: 'a' }, …(1) ] // Object.is equality

[Killed] BlockStatement
library/generator/expressions/sorter.js:14:49
 
     sort (expressions) {
         return expressions.slice()
-            .sort((expressionA, expressionB) => {
-                const precedenceExpressionA = this.getExpressionPrecedence(expressionA);
-                const precedenceExpressionB = this.getExpressionPrecedence(expressionB);
-
-                return precedenceExpressionA - precedenceExpressionB;
-            });
+            .sort((expressionA, expressionB) => {});
     }
 }
killedBy: Expression sorted Should sort expressions
statusReason: expected [ NameExpression{ name: 'a' }, …(5) ] to deeply equal [ NameExpression{ name: 'a' }, …(5) ]

[Killed] ArithmeticOperator
library/generator/expressions/sorter.js:18:24
                 const precedenceExpressionA = this.getExpressionPrecedence(expressionA);
                 const precedenceExpressionB = this.getExpressionPrecedence(expressionB);
 
-                return precedenceExpressionA - precedenceExpressionB;
+                return precedenceExpressionA + precedenceExpressionB;
             });
     }
killedBy: Expression sorted Should sort expressions
statusReason: expected [ NameExpression{ name: 'a' }, …(5) ] to deeply equal [ NameExpression{ name: 'a' }, …(5) ]
